{
    "DRP-302.json": "An X-ray computed tomography was carried out in two varieties of samples condition: air-dried and moistened behind the field capacity condition. To rich the last one the sample was taken after the tomography and was moistened by the excess water through the base of several filter papers. The moistening stretched in 7 full days with permanent water filling-up until the water table occurred on the base surface. Then the sample was free drained on a sandy base reaching the constant weight without evaporation. After above mentioned process the sample was imaged by microtomograph for 2-3 hours. Wherein, soil humidity was being constant during imaging.",
    "DRP-247.json": "The sample porous medium is from Mt. Simon sandstone at a depth of 6700 feet. The formation is located at verification well number 2 of a study site in Decatur, Illinois where Illinois State Geological Survey carried out a pilot injection study to better understand the feasibility of full-scale carbon capture and storage (Finley, 2014). A core plug from the formation was scanned by micro-CT imaging technique at the National Energy Technology Laboratory (NETL) of the U.S. Department of Energy, which produced a series of grey-scale scans with a voxel size of 2.80 microns. A series of image processing steps were taken in Fiji to filter and smooth images in order to distinguish void space from the solid grains via a thresholding algorithm. The outcome is a segmented 1200^3 voxels sample with a physical size of 3.36^3 mm^3 that is used in a study of the morphology of the sandstone and its heterogeneity, and simulation of single-phase and two-phase flow of CO2 and brine in the formation's three-dimensional images (Kohanpur et al., 2019).\r\n\r\nReferences:\r\n[1] Finley, Robert J. \"An overview of the Illinois Basin–Decatur project.\" Greenhouse Gases: Science and Technology 4.5 (2014): 571-579.\r\n[2] Kohanpur, Amir H., et al. \"Two-phase flow of CO2-brine in a heterogeneous sandstone: Characterization of the rock and comparison of the lattice-Boltzmann, pore-network, and direct numerical simulation methods.\" Advances in Water Resources (2019): 103469.",
    "DRP-314.json": "Four fractures with periodic boundaries exhibiting increasing fractal dimensions (1.5, 1.75, 2.0, 2.25) and 3 different wettability patterns (A, B, C) are presented.  The fractures were created with SynFrac and mirrored to obtain a longer domain.  Each fracture is 128 x 256 and periodic in the y-direction.  Each wettability pattern has a similar histogram, and is based on the supplemental information Figure Si.7c from Gerke et al. (2015).  These fractures were used for CO2 displacement lattice Boltzmann simulations.",
    "DRP-251.json": "Pore-scale digital images are usually obtained from micro computed tomography (micro-CT) data that has been segmented into void and grain space. Image segmentation is a critical process for digital rock analyses that can influence pore-scale characterisation studies and/or the numerical simulation of petrophysical properties. This project is to study on the sandstone micro-CT image segmentation by using convolutional neural network.",
    "DRP-441.json": "We created 3D-printed fracture networks and conducted thermal flow experiments. The fracture sample was designed using the freely available OpenSCAD software (https://openscad.org/). The fracture section consisted of nine intersecting disc-shaped fractures. The fractures overlapped to form a flow-channel from one end of the model to the other end. The zigzagging structure was chosen considering the model size constraints set by the 3D printer and the need to ensure enough flow-channel surface area to obtain effective temperature data. An ultraviolet curing type 3D printer (Agilista 3100, KEYENCE co.) generated a 3D-printed sample consisting of acrylic ultraviolet-curing resin. The flow-channel or cavity space was sculpted by the printer with a support material. After 3D printing the sample object, the water-soluble support material was removed to create a clean fracture structure by washing the 3D-printed sample in an ultrasonic bath for several days. \r\n\r\nThe fracture sample was used for thermal flow experiments. Before running the flow experiments, the fracture model and flow tubes were saturated with hot water. Cold water was injected with constant flow rates of 15, 20, 25, and 30 ml/min. Temperature changes were measured in the inlet beaker, at the fracture inlet, at the fracture outlet, and in the heat bath.\r\n\r\n  Reference: https://doi.org/10.1016/j.geothermics.2022.102480",
    "DRP-504.json": "These videos serve as complimentary multimedia data for the paper:\r\n\"Mudrock Wettability at Pressure and Temperature Conditions for CO2 Geological Storage\" published in the International Journal of Greenhouse Gas Control (preprint available in http://dx.doi.org/10.2139/ssrn.4709815)\r\n\r\nThe videos show the behavior of water and brine droplets as released on top of porous media (resedimented mudrocks, Berea sandstone, and Berea sandstone treated to be hydrophobic) immersed on supercritical CO2 (pressure range: 26 to 41 MPa; temperature range: 60 to 90C). \r\nThe results show that water and brine imbibe quickly and spontaneously in resedimented mudrocks, supporting expectations of water-wet mineral surfaces and structural sealing of buoyant scCO2 by capillary forces.",
    "DRP-154.json": "Computed Tomography images of foamed cement created using the American Petroleum Institute's Recommended Practice 10B-4. Two different recipes were used to make 10%, 20%, 30%, or 40% atmospheric foam cement.",
    "DRP-142.json": "We formed methane hydrate by injected methane gas into a coarse-grained, brine-saturated sand back that was in the hydrate stability zone. For comparison, we performed a gas drainage experiment at same pressure, but with the sample temperature outside the hydrate stability zone. Both these projects were performed in the computed tomography (CT) scanner located in the Petroleum and Geosystems Engineering Department at the University of Texas at Austin. This Digital Rocks project contains the raw and processed CT data taken during those experiments.",
    "DRP-379.json": "A drainage experiment was conducted with analog fluids in an intermediate-scale beadpack to characterize CO2 migration and trapping under strongly gravity- and capillary-dominated flow regimes. The quasi-2D beadpack contains two simple capillary barriers and the light transmission visualization method was used to capture nonwetting phase saturation results.",
    "DRP-11.json": "The effect of pore-scale heterogeneity on non-Darcy flow behaviour is investigated by means of direct flow simulations on 3-D images of Bentheimer sandstone and Estaillades carbonate. The critical Reynolds number indicating the cessation of the creeping Darcy flow regime in Estaillades carbonate is two orders of magnitude smaller than in Bentheimer sandstone, and is three orders of magnitude smaller than in the beadpack.",
    "DRP-162.json": "Medical CT scans of Guelph dolomite for fracture characterization. The core was imaged in Department of Petroleum and Geosystems Engineering, UT Austin. Data processing supported by NSF CAREER grant (Prodanovic).",
    "DRP-477.json": "The lunar regolith simulant (FJS-1 by Shimizu Corporation) was made from geological materials from Earth and designed to replicate the chemical composition and grain size of the actual lunar regolith. The simulant is composed of plagioclase, pyroxene, ilmenite, and glass fractions in relative proportions of 0.439, 0.246, 0.153, and 0.138, respectively. The bulk density of the simulant is 1.55 g/cm3 and its grain density is 2.94 g/cm3.",
    "DRP-359.json": "These data sets contain reconstructed micro-CT images of trapped nitrogen gas in porous media during the dissolution process and the formation of dissolution fingering. \r\n\r\nIn total, eight data sets are available. Each data set contains the reconstructed micro-CT images obtained in different observation time during dissolution process. Seven of the data sets were performed by packing various granular particle sizes and ranges inside a 10-mm-diameter-cylindrical-container. Another data set was performed by packing granular particles inside a 20-mm-diameter-cylindrical-container. The dissolution fingering formation can be observed in some of the data sets in the packing inside a 10-mm-diameter-cylindrical-container. Clearer dissolution fingering formation can be observed inside a 20-mm-diameter-cylindrical-container.\r\n\r\nThese datasets were presented and utilized in the paper of \"Effects of Dissolution Fingering on Mass Transfer Rate in Three-Dimensional Porous Media\" (see Related Publications) in Water Resources Research in 2021. Full details of the experimental setup, procedure, and imaging analysis can be found in the paper and supporting information.",
    "DRP-31.json": "X-ray microtomography was used to map the internal structure of a rough fracture. The artificially created fracture was oriented parallel to the natural bedding of the rock.",
    "DRP-135.json": "Three water-wet sandstone types (Bentheimer, Berea, and Leopard) at different multiphase (air and brine) saturation conditions; including dry (irreducible water saturation), and partially drained. Data was acquired at the Australian National University CTLab, and image processing was accomplished via Mango. Please refer to the following for details: \r\nHerring, A. L., Robins, V., & Sheppard, A. P. (2018). Topological Persistence for Relating Microstructure and Capillary Fluid Trapping in Sandstones. Water Resources Research, 54. https://doi.org/10.1029/2018WR022780\r\n\r\nPlease cite both this dataset (use its DOI) as well as the related journal publication.",
    "DRP-70.json": "2D fractional-wet medium including oil-wet and water-wet portions.\r\nThe medium is meshed using COMSOL.\r\nThe mesh file is converted to the OpenFOAM format using an in-house package. \r\nThe attached file contains \"constant\" and \"system\" folders and the case can be easily customized for CFD-based studies using OpenFOAM.",
    "DRP-461.json": "The dataset contains micro-CT images for steady-state co-injection experiments performed on a cylindrical Bentheimer sandstone with one-inch diameter. Scans were obtained using the “High Energy micro-CT Optimized for Research” scanner (HECTOR) at the center for X-ray tomography at Ghent University (UGCT). The experiments were conducted with nitrogen as the non-wetting phase and brine (25 wt% potassium iodine) as the wetting phase. The confining pressure and the back pressure were set to 4000 kPa and 2000 kPa respectively.",
    "DRP-363.json": "The dataset contains micro-CT images for an Estaillades sample used in drainage experiment. Data was obtained using Environmental Micro-CT (EMCT) scanner at Ghent University’s Centre for X-ray Tomography (UGCT) (Bultreys et al., 2016).\r\nThe sample is 6.5 mm in diameter and 20 mm in length, with porosity of 25%. Six capillary pressure steps were performed during the experiment, at 8, 14, 80, 180, 220 and 400 kPa. More details on experimetal procedure and data processing can be found in Wang et al., (2021). The data can be used to investigate pore-scale fluid distribution and validate multi-scale pore network models.",
    "DRP-334.json": "Scans of strongly-wet Bentheimer sandstone core acquired during primary imbibition experiments at voxel size equal to 0.001657314 mm=1.657314 micron. The dimension of all the data set is 1200 voxel*1200 voxel*5000 voxel, corresponding to a physical volume of 32.77 mm^3.\r\nA total of four sets of tomographic data are presented in this project, including a 'dry scan' acquired before the water-flooding experiment, and three sets of 'wet scan' acquired during the primary imbibition experiment, with the wetting saturation equal to 11%, 28%, and 53%, respectively. The non-wetting and wetting phase in this study are air and brine (water doped with KI), respectively.\r\n\r\nThe nc files can be read in ImageJ software via NetCDF plugins (http://www.unidata.ucar.edu/software/netcdf/).\r\n\r\nPlease refer to the following publication for details of the scans:  Huang, R., Herring, A.L., & Sheppard, A. \"Effect of Saturation and Image Resolution on Representative Elementary Volume and Topological Quantification: An Experimental Study on Bentheimer Sandstone Using Micro-CT,\" Transp. Porous Media, doi: 10.1007/s11242-021-01571-9 (2021). Please cite both this dataset (use its DOI) as well as the related journal publication.",
    "DRP-158.json": "This file contains X-ray computed microtomography (CMT) images used to analyze abiotic carbonate precipitation in porous media from a supersaturated solution. An X-ray transparent and rigid-walled polycarbonate column was developed to hold the sand pack tight during the carbonate precipitation process. The column consisted of a polycarbonate tube with an inner diameter of 3.18 mm, an outer diameter of 9.53 mm, and a height of 44.1 mm. Two polycarbonate discs and two stainless steel springs were used to confine the sand pack in the polycarbonate column. Dry sand particles were hand-tamped on the polycarbonate disc attached to the spring in the column. Then, this compacted sand pack was topped with the second disc and spring, to hold it in position during the experiment.\r\nCalcium carbonate (carbonate) precipitation was achieved by using supersaturated solution of carbonate. The supersaturated carbonate solution was flowed to the sand pack to induce calcium carbonate precipitation using the sand grain surfaces as nucleation sites. The flow continued until the porosity was reduced to ~17%, at which point the peristaltic pump could not circulate the fluid at the given flow rate due to the flow resistance caused by lowered porosity and permeability.  The sand pack was X-ray CMT imaged prior to precipitation procedure which is referred to as baselines scan (Scan 0). During the experiment, X-ray CMT imaging was conducted on the sand pack column when a significant reduction in permeability was observed. Total three precipitation scans (Scan 1,2, and 3) were obtained.",
    "DRP-267.json": "Compressed data sets for several tomographic images and segmented data are available, with a reference to publications tab for details. The data sets are capturing segmented micro-CT images and distance maps derived on these segmented datasets. The distance maps represent different potentials and boundary conditions for setting capillary pressure, mimicking mercury intrusion capillary pressure (MICP), porous plate (PP) and centrifuge capillary pressure (CP) profiles. Calculations are carried out under the assumption of perfect wetting.\r\n\r\nWe envisage modelling more complex wetting behaviour in the future; the data is made available in context of a joint collaboration between University of Texas Professor Masa Prodanovic and University of New South Wales Professor Christoph Arns. Data sets are produced from the University of New South Wales in Sydney. The data sets are available in NetCDF format; Python files that read them into NumPy arrays and export .tiff are provided and created by Ahad Momin. ImageJ and NCview are other options for reading NetCDF files.",
    "DRP-118.json": "Micro-CT binarized image of a tight carbonate formation in middle east",
    "DRP-231.json": "The dataset contains the height map of the surface of Ketton rock obtained with atomic force microscopy, the corresponding 3D reconstruction and the results of a drainage simulation.",
    "DRP-374.json": "This project presents several 3D binary geometries (artificially created) that represent a wide variety of systems. We represent the pore-space with zeros and the solid voxels with ones. We have included sphere packing (eroded and dilated to create pore structure similar in shape but a variation of porosity), single fractures, packings with overlapping spheres, shale reconstructions and fractures with permeable walls, among others. Most of the samples are presented as a cube of side length 256 voxels, some include an additional one with 480 voxels. These are dimensionless and can be scaled to any physical length of interest.\r\n\r\nEach image was checked for connectivity in z-direction (third axis) and the isolated components were removed. Each dataset includes a binary file (in hdf5 format), a 3D picture showing the voxelized geometry, and a plot showing cross-sectional planes of the domain. These images were plotted using Vedo and PyVista, respectively. \r\n\r\n---------------------------------------\r\nTo load the geometry in python:\r\n---------------------------------------\r\nfrom hdf5storage import loadmat\r\nbin = loadmat('374_01_00_256.mat')['bin']\r\n\r\n---------------------------------------\r\nTo load the geometry in matlab:\r\n---------------------------------------\r\nload('374_01_00_256.mat')",
    "DRP-159.json": "These files are Berea and Mt. Simon sandstone micro-CT data sets at residual conditions from the paper Methods to Measure Contact Angles in scCO2-Brine-Sandstone Systems. They are 16-bit image stacks cropped from one larger sandstone micro-CT scans and are being provided for additional researchers to use manual and automated contact angle measurement methods to measure contact angles for a comparison to the paper results.",
    "DRP-509.json": "The complementary images acquired for the super-resolution dataset were obtained through scanning electron microscope (SEM) scanning. These images are suitable for testing super-resolution networks.\r\n\r\nShale samples from five regions in China—Gulong, Jiyang, Jimusar, Yanchang, and Changqing—were scanned using two types of SEMs: the Quanta 200F Field-Emission Environmental SEM (FEE-SEM) and the Hitachi SU8010 Field-Emission SEM (FE-SEM). The Quanta 200F FEE-SEM, made by Thermo Fisher Scientific in the USA, features a field emission gun that enables operations under high vacuum, low vacuum, and environmental SEM modes. This versatility allows for the analysis of various sample types under different conditions. The Hitachi SU8010 FE-SEM, produced by Hitachi High-Tech Corporation in Japan, is equipped with a secondary electron detector and an energy-dispersive X-ray (EDX) detector, including the Bruker EDX Detector and EDX XFLASH Detector, which enhance its capability for detailed compositional analysis.\r\n\r\nThe FEE-SEM captured grayscale images of the shale samples from all five regions at magnifications of 1X, 2X, 4X, 8X, and 16X, corresponding to voxel lengths of 9.1 nm, 18.2 nm, 36.4 nm, 72.8 nm, and 145.6 nm, respectively. The FE-SEM specifically scanned shale samples from the Gulong and Jiyang regions at the same five magnifications, with corresponding voxel lengths of 12.4 nm, 24.8 nm, 49.6 nm, 99.2 nm, and 198.4 nm. Actually, the FE-SEM and FEE-SEM images are not for the same location. This is partially because matching the same the location is quite difficult using two different equipments. The purpose of using two equipments is to show the observed phenomena is general but not limited to any specific equipment.",
    "DRP-362.json": "A Multi-Resolution Complex Carbonates Micro-CT Dataset (MRCCM)\r\nOverview: This dataset contains multi-resolution X-ray micro-computed tomography images of two complex carbonate rocks. The images included can be used to study partial volume effects, sub-resolution artifacts, segmentation methodology on digital rock analyses, and modeling. Furthermore, these images can be used for benchmarking deep learning frameworks for super-resolution, segmentation, or both (see related publication tab).\r\n\r\nMaterials: The carbonates are Indiana Limestone (ILS) and Middle Eastern Carbonate (MEC) samples. Both rocks are monomineralic with over 95% calcite content and rare occurrence of other minerals such as quarts and micrite. Both rocks display a variety of microporous textures characterized by lower greyscale intensity levels (this can be seen in HR images). Mercury Intrusion Capillary Pressure (MICP) tests indicate a dual pore system in both carbonates. A detailed description can be found in the related journal publication.\r\nILS MICP total porosity: 16.38%\r\nILS MICP Macroporosity: 9.17%\r\nILS MICP Microporosity 7.22%\r\nMEC MICP total porosity: 29.79%\r\nMEC MICP Macroporosity: 17.84%\r\nMEC MICP Microporosity 10.97%\r\n\r\nImage acquisition and processing: The 6 mm in diameter core plugs are imaged at a high spatial resolution (HR) of 2.68 micrometer/voxel and a low spatial resolution (LR) of 10.72 micrometer/voxel. The core plugs are imaged at the University of New South Wales using HeliScanTM micro-CT (Mark I). The segmentations were performed using Avizo Software using a combination of watershed and hysteresis algorithms. The segmented images containing three phases, namely: (1) macropores, (2) solid grains, (3) microporosity (sub-resolution porosity).\r\n\r\nCitation: To use this free data, we ask you to cite both (DOI) of this project and the related journal publication.\r\n\r\nFile Organization:\r\n-Raw tomograms:\r\nWe provide the raw tomograms of both rocks at high and low resolution. The raw files are in .nc format which can be opened using ImageJ, netCDF4 Python library, Matlab, Avizo, and many other software. The size of each (.nc) block is [2520 2520 40] voxels in X, Y, and Z directions and should be concatenated in sequence along the z-axis. The (,nc) variable name is set to 'tomo'.\r\n>Raw tomograms\r\n--High-resolution Indiana Limestone Tomogram (HR ILS Tomogram) - [101 Blocks]\r\n--High-resolution Middle Eastern Carbonate Tomogram (HR MEC Tomogram) - [119 Blocks]\r\n--Low-resolution Indiana Limestone Tomogram (LR ILS Tomogram) - [25 Blocks]\r\n--Low-resolution Middle Eastern Carbonate Tomogram (LR MEC Tomogram) - [31 Blocks]\r\n\r\n-Processed Volumes:\r\nMatching central LR & HR greyscale domains of each rock are provided as Matlab arrays (.mat). The HR domains are scaled four times the size of the LR domain. The Matlab arrays are saved in version ‘-v7.3’ and can be opened in Matlab and Python using h5py Python Library. The HR volumes are divided into 4 files and need to be concatenated along the z-axis to obtain the same LR image. \r\n\r\nThe segmented HR images using Avizo are also made available. The testing volume used in our publication is the domain enclosed by the first 256 voxels in LR images and 1024 voxels in HR images in X, Y, and Z directions.\r\n> Processed Volumes\r\n-- HR Volumes (.mat) files (concatenate along z-axis)\r\n-- LR Volumes (.mat) files\r\n-- HR Segmented Volumes (.mat) files",
    "DRP-175.json": "3D velocity fields obtained experimentally performing high resolution PTV in the bulk of a transparent porous medium at low Reynolds number (~10^-3). The porous medium is made out of a three dimensional random stack of monodisperse rigid spherical PMMA particles of diameter d = 2 mm. The sampled volume of porous medium is (5d*5d*9d), and the resolution is one pixel=d/120.\r\n\r\nThe stationary flow is obtained by pushing fluid (seeded with passive fluorescent tracers) through the porous medium with an imposed flow rate. The velocity field is obtained by accumulating data over 1000 successive images in a slice of the porous medium. A PTV algorithm provides the fluid velocity within each pixel, thus outperforming most recent PIV techniques in terms of spatial resolution.\r\n\r\nThe 3D velocity field is obtained by repeating the above 2D velocity field measurement over 50 slices spaced every d/10 = 200 um, in both the y and z-directions. Using linear interpolation we obtain the 3D velocity field over the whole sampled domain, where VX, VY, VZ are the velocity components in the x,y,z directions. Finally, a weighted divergence correction scheme is used to ensure the incompressibility of the 3D velocity field, while having negligible effect on the velocity distributions.\r\nThe experimentally measured velocity fields are used to investigate dispersion, stretching, and mixing in porous media.\r\n\r\nThis data set contains the 3D binary microstructure and the 3D divergence free velocity fields (both in raw format and Matlab format). Velocities are expressed in meter/sec, and the average velocity amplitude <U> = sqrt(VX^2+VY^2+VZ^2) = 127e-6 m/s.\r\n\r\nDatas has been used to develop Pore Aventura, a 3D velocity field explorer, that can be found on GitHub (https://github.com/Nico04/Pore-Aventura). For an introduction video, check (https://www.youtube.com/watch?v=NkHmAcAheAQ&feature=youtu.be)\r\nData has been acquired in IUSTI Lab, UMR 7343, Aix-Marseille Université.\r\nData set authors: Mathieu Souzy, Henri Lhuissier, Yves Méheust, Tanguy Le Borgne and Bloen Metzger.\r\nMain Related Publication : \"Velocity distributions, dispersion and stretching in three-dimensional porous media\", Journal of Fluid Mechanics, doi:10.1017/jfm.2020.113\r\nAuthor contact : mathieu.souzy@gmail.com",
    "DRP-460.json": "The dataset contains micro-CT images for quasi-static oil- and waterflooding experiments performed on two sister heterogeneous sandstone samples, where one sample (20 mm in length and 6 mm in diameter) was water-wet, and another (13 mm in length and 6 mm in diameter) was chemically treated to be mixed-wet by immersing the sample in 25 ml of decane with 5 wt.% octadecyltrichlorosilane (OTS) and sonicating it in an ultrasonic bath for 5 minutes. After 24 hours, the sample was removed from the solution, followed by cleaning with isopropanol and drying. Scans were obtained using Environmental Micro-CT (EMCT) scanner at Ghent University’s Centre for X-ray Tomography (UGCT).",
    "DRP-319.json": "This dataset contains the raw projection images of time-resolved laboratory based micro-CT data of solute injection experiments in sintered glass, Bentheimer sandstone and Savonnières limestone. The reconstructed (cropped and registered) datasets are available on Digital Rocks Portal (project 221 (DOI: 10.17612/5ww0-gh34) and 264 (DOI: 10.17612/JPVB-JG13)). The data were acquired with a gantry-based micro-CT system specially designed for in-situ imaging (UGCT). The experiments were imaged at 12 or 15 s per scan (full rotation) with a voxel size of 12.95 to 14.6 µm (Bultreys et al., 2016; Van Offenwert et al., 2019). Each fast imaging experiment was preceded by a higher quality pre-scan to determine the static pore structure. Voxel-based or pore-based concentration fields can be quantified based on the reconstructed grey values. Based on this, solute spreading and mixing during tracer injection experiments can be investigated. \r\nThe raw projection data of this project allows to perform and test reconstruction algorithms. In addition, the data can be used for radiography-level measurements with a time resolution limited to 20 ms.",
    "DRP-122.json": "This project includes high resolution micro-CT images of one xenon hydrate growth experiment in sand.\r\n\r\nData are from a paper by Xiongyu Chen, Rahul Verma, D. Nicolas Espinoza and Masa Prodanovic, published in Water Resources Research in 2018, titled \"Pore-Scale Determination of Gas Relative Permeability in Hydrate-Bearing Sediments Using X-Ray Computed Micro-Tomography and Lattice Boltzmann Method\"\r\n\r\nConditions for xenon hydrate growth in sand: T=23C, P_initial =3.72 MPa. Aqueous phase is 10wt% NaBr brine. The image stack is taken with X-ray uCT after 4 days of hydrate growth. Resolution =28.77 um.\r\n\r\nX-ray microfocus scanning was performed at the  Chevron Digital Petrophysics Laboratory <https://faculty.engr.utexas.edu/espinoza/espinoza/microct",
    "DRP-1.json": "Partially crystallized packings of frictional, equal-sized spheres. A batch of approximately 200,000 beads is poured into a cylindrical container forming an initial packing in a random configuration with a volume fraction ranging from 57% to 63%. The packing is then shaken intensely for few seconds, to the point of fluidization, where a fast compaction is observed. The resulting global packing density reaches 70.5%.",
    "DRP-134.json": "Micro-CT scans of a fast synchrotron-based micro-CT flow experiment performed in Gildehauser sandstone rock.\r\nThe data set consists of \r\n- dry scan (at higher quality settings that the flow experiment itself)\r\n- dry scan segmented \r\n- time sequence of imbibition experiment (40 s time intervals), segmented into rock,oil and water phase",
    "DRP-421.json": "The tomogram and segmentation of Bentheimer, Castlegate, and Leopard Sandstones. For Bentheimer sandstone, it is segmented into pore, quartz, feldspar, clay region and high-density mineral. For Castlegate sandstone, the samples are segmented into three phases, including pore, quartz, and clay region. For Leopard, the additional high-density mineral phase is identified. The images can be utilized to specifically analyze clay effects, which most studies ignore (or merge together with the solid or open-pore space). Also, the NMR-related properties of each phase can be derived by matching the simulation results to experimental data (e.g. surface relaxivity, magnetic susceptibility). The images are in netCDF format, which can be visualized by 'ncview'. This is free software licensed under the Gnu General Public License version 3.",
    "DRP-88.json": "The objective of this study was to obtain pore-scale images of residual gas in three different pore structures using X-ray computed microtomography in order to measure gas ganglia capillary pressures using air/brine interfacial curvature measurements. \r\n\r\nThe present data set consists of raw images of air and brine after a gravity-driven imbibition in three samples: a glass bead pack, a Boise sandstone and a Fontainebleau sandstone, acquired with various resolution (2X - 4X/5X - 10X)  leading to voxel sizes ranging from 4.44 µm to 0.64 µm.\r\n\r\nAll the data were acquired at the Beamline 8.3.2 (Synchrotron-based Hard X-ray Micro-Tomography) at the Advanced Light Source, Lawrence Berkeley National Laboratory.",
    "DRP-378.json": "This dataset consists of  time-resolved laboratory-based micro-CT images of oil- and waterflooding experiments in two twin Luxembourg Sandstone samples. One sample was used in its native hydrophilic state while the second was chemically altered to have a mixed-wettability. Scans were obtained using a TESCAN DynaTOM system.",
    "DRP-10.json": "The effect of pore-scale heterogeneity on non-Darcy flow behaviour is investigated by means of direct flow simulations on 3-D images of Estaillades carbonate. The critical Reynolds number indicating the cessation of the creeping Darcy flow regime in Estaillades carbonate is two orders of magnitude smaller than in Bentheimer sandstone, and is three orders of magnitude smaller than in the beadpack. It is inferred from the examination of flow field features that the emergence of steady eddies in pore space of Estaillades at elevated fluid velocities accounts for the early transition away from the Darcy flow regime. \r\n\r\nFurther details can be found in Muljadi et al., Advances in Water Resources (2015), URL:http://dx.doi.org/10.1016/j.advwatres.2015.05.019",
    "DRP-285.json": "The tight sandstone samples collected from Yanchang oil field , China are used to conduct hydraulic fracturing experiment with fluid of water, N2 and CO2. These  samples are scanned by Micro-CT scanning pre and post-hydraulic fracturing experiment. All of the images are obtained on the resolution ( voxel size ) of 53 μm under working voltage of 120 KV and current of 62.5 μA.  After rock was scanned, the whole-size fracture can be extracted through post-processing method. Furthermore, the morphology of fracture and the quantitative attributes of fracture, such as fractal dimension, aperture etc, are analyzed based on these scanned images. Additionally, the extracted fractures from image data can be directly used into numerical model of fracture simulation. We upload these initial slice images of scanned rock to this project, which include rock sample pre-experiment and samples fractured by water, nitrogen and SC-CO2.\r\n\r\nRock dimension: diameter of 50 mm, height of 100 mm.",
    "DRP-47.json": "We provide data on a packing of equal, hard spheres. The original data was experimentally (optically) imaged in 1970, and this is one of the first sphere packings used as a representative porous medium (soil, and with some cementation modeling sandstone). \r\n\r\nWe include original sphere locations,  as well as an example discretization (volumetric image). With some effort, sphere locations can be used to produce a volumetric image at any resolution you need.",
    "DRP-513.json": "Factional flow experiments conducted with decane and brine in a sintered glass filter (Robuglas).\r\n\r\nThe sample was a water-wet, sintered glass sample called Robuglas with a porosity of 0.33, permeability of 22 Darcy,\r\n4 mm diameter, and 20 mm length. Dynamic high-resolution 3D images were collected at the TOMCAT beamline\r\nat the Swiss Light Source, Paul Scherrer Institute, Villigen, Switzerland. The images were collected at 36 KeV at a\r\nresolution of 4.22 μm. Cesium chloride was used as the contrast agent and was added to the WP as a 1:6 weight ratio.\r\nA total of 1500 radiographs with 40-ms exposure times were collected for a single 3D image. Images were collected under dynamic flow conditions, i.e., co-injection of decane and brine. \r\n\r\nWe imaged fluid distributions at Q T = 3, 30, and 300 μl/min for each F_w (fractional flow) tested to evaluate a range of different capillary numbers (Ca = 10^−6, 10^−5, and 10^−4 ). The filename corresponds to the total flow rate (Q_T) and fractional flow condition imaged.\r\n\r\nFlow mechanisms were analysed in the linked Petrophysics paper. Also, a selection of images were used as initialisation conditions for the LBM simulations reported in the linked Physical Review E publication.\r\n\r\nThe file format (.am) can be opened with Avizo or Fiji (Image J) software. \r\n\r\nVoxel values are the following: grain is 3, water is 2, and oil is 1.",
    "DRP-339.json": "This is the image dataset used in the study of Phillips et al. (2021), containing micro-CT images of single-phase (tagged brine solution with 5 wt. % potassium iodide) fluid flow through a single 3D-printed rough fracture. Data was acquired using a gantry-based micro-CT system, specifically designed for in-situ imaging (UGCT) (Bultreys et al., 2016). Steady-state fluid flow experiments, imaged with a voxel size of 5.76 µm, were undertaken at four different effective stresses (5, 9.2, 12.8 & 13.8 bar) with a constant flow rate of 0.073 mL/min. Further details on the raw micro-CT images, fracture segmentation, experimental parameters, and sample properties, can be found in Phillips et al. (2021) and corresponding supporting information. This dataset can be used to investigate the influence of aperture structure on fluid flow under different effective stresses.",
    "DRP-293.json": "A total of 65 measurements were collected during air-water two-phase flow experiments at which the capillary pressure and water saturation were measured. These measurements are labeled as AW_02 through AW_65, and AW_DryScan as the image of the dry sample before the two-phase experiments. AW_02 through AW_14 were the measurements along second imbibition obtained by imbibing water into a granular sample at a rate of 6 ml/hr after saturation and primary drainage. AW_15 through AW_27 were measurements along the second drainage curve obtained by draining water at a rate of 6 ml/hr through the sample. The third imbibition was carried out also at a pump rate of 6 ml/hr and encompasses the measurements AW_28 through AW_41. These were the quasi-equilibrium drainage and imbibition experiments. \r\n\r\nOne-step experiments (quasi-equilibrium end points for drainage and imbibition experiments) were conducted on the same sample to observe the effects of different pump rates (0.5 ml/hr–8 ml/hr) on the saturation and capillary pressure in accelerated drainage and imbibition experiments. The pump rate for each one-step experiment is outlined below. \r\n\r\nThe setup contained air vents that allowed us to facilitate air access directly into the imaged section during the unsaturated portions of the drainage cycles. The vents were sealed off during high saturation with tape. The experiments with air access during drainage are identified in the sequence as “tape off” below.\r\n \r\nAll scans were collected on GSECAR's 13-BM-D beamline at the Advanced Photon Source, Argonne National Laboratory.\r\n\r\nAW_42: drainage 6.0 ml/hr\r\nAW_43: imbibition 0.5 ml/hr\r\nAW_44: drainage 0.5 ml/hr\r\nAW_45: overnight equilibration of AW_44\r\nAW_46: imbibition 2.0 ml/hr\r\nAW_47: drainage 2.0 ml/hr\r\nAW_48: imbibition 4.0 ml/hr\r\nAW_49: drainage 4.0 ml/hr\r\nAW_50: imbibition 8.0 ml/hr\r\nAW_51: drainage 8.0 ml/hr\r\nAW_52: imbibition 2.0 ml/hr\r\nAW_53: drainage 2.0 ml/hr\r\nAW_54: imbibition 2.0 ml/hr\r\nAW_55: drainage 2.0 ml/hr\r\nAW_56: imbibition 0.5 ml/hr\r\nAW_57: drainage 0.5 ml/hr (tape off)\r\nAW_58: imbibition 2.0 ml/hr\r\nAW_59: drainage 2.0 ml/hr (tape off)\r\nAW_60: imbibition 4.0 ml/hr\r\nAW_61: drainage 4.0 ml/hr (tape off)\r\nAW_62: imbibition 8.0 ml/hr\r\nAW_63: drainage 8.0 ml/hr\r\nAW_64: imbibition 2.0 ml/hr\r\nAW_65: drainage 2.0 ml/hr",
    "DRP-51.json": "A number of glass bead packs have been sintered to slightly consolidate them and create artificial rock samples with high porosity (~42%)  and uniform grain size (~1 mm). One of the samples was imaged with x-ray microtomography, and the others were flooded with different suspensions. \r\n\r\nCore flooding has been done for different flow rates, concentrations and bimodal particle sizes and each sample and CT images were taken before and after each suspension flood. The samples are labelled as follows:\r\n\r\n1. The alphabet signifies the particle size:\r\n        F = particle size 50/100 micron\r\n        B = particle size 25/100 micron\r\n        R = particle size 25/50 micron\r\n\r\n2. The second two digit are the flow rate is cubic centimeter per minute\r\n\r\n3. The last two digit (divide by 10) are the total injection concentration\r\n\r\ne.g. F6005 implies:\r\n- particle size = 50/100 micron\r\n- flow rate = 60 cc/min\r\n- total injection concentration = 0.5%\r\n\r\nCT data has been acquired in Dr. DiCarlo Lab in Department of Petroleum and Geosystems Engineering, UT Austin.\r\nX-ray microfocus CT scanning was performed at the  Chevron Digital Petrophysics Laboratory <https://faculty.engr.utexas.edu/espinoza/espinoza/microct.",
    "DRP-440.json": "Segmented (Pore/Solid) 3D x-ray computed micro-tomography (CMT, XCMT) images of cement-bridged (partially-cemented, mineralized, mineralised) fractures sampled from core. The core was retrieved from tight-sandstone gas reservoir rock of the Travis Peak formation and Mesaverde Group. Only the residual pore space of the cemented fracture is resolved, the matrix pore space is below image resolution.",
    "DRP-102.json": "Carbonate whole cores used to test new methodology for dual energy X-ray CT inversion.",
    "DRP-92.json": "Image stack of a multiscale microstructure including inter- and intragrain pore spaces.",
    "DRP-250.json": "We provide CT-scan data of six Bentheim sandstone specimens with a diameter of around 10 mm and a thickness of 7 mm for the Brazilian tensile tests. It includes the CT-scan data of six specimens after the test. The average grain size is 200 μm and the porosity is around 20%. The file type \".dcm\" is used in AVIZO.",
    "DRP-196.json": "X-ray CT images of Paluxy sandstone from Kemper County, MS. These images were collected and analyzed as part of the “Establishing an Early CO2 Storage Complex in Kemper, MS” project (grant number FE0029465) funded by the U.S. Department of Energy’s National Energy Technology Laboratory and cost-sharing partners and managed by the Southern States Energy Board. \r\n\r\nThis sample is a predominantly quartz, high porosity and high permeability sandstone sample. This data was taken with the objective of quantifying properties of the pore network structure.",
    "DRP-207.json": "FIB-SEM data (voxel size 2.5nm x 2.5nm x 5nm) of the Vaca Muerta formation",
    "DRP-211.json": "Digital Rocks Super Resolution Dataset 1: Sandstone and Carbonate micro-CT Images used for 2D and 3D Super Resolution Machine Learning Training, Validation, and Testing.\r\n\r\nThis dataset comprises of organised 2D slices and 3D volumes of Bentheimer Sandstone [sourced internally from UNSW] and Estaillades Carbonate [https://www.digitalrocksportal.org/projects/58/origin_data/209/], imaged at a resolution of 3.8 and 3.1 microns respectively. \r\n\r\nThe dataset is organised in a similar fashion to the DIV2K dataset : (https://data.vision.ee.ethz.ch/cvl/DIV2K/). To the knowledge of the authors, this dataset is the first of its kind to be used for the purpose of benchmarking Super Resolution algorithms in digital rock images. This dataset has been used thus far to test several Super Resolution Convolutional Neural Networks (SRCNN). Results are described in the Related Publications tab on this page.\r\n\r\nWang, Y., Armstrong, R.T., &  Mostaghimi, P. (2019). Super Resolution Convolutional Neural Network Models for Enhancing\r\n  Resolution of Rock Micro-CT Images. arXiv:1904.07470  ( https://arxiv.org/pdf/1904.07470.pdf )\r\n\r\nPlease cite both this dataset (use its DOI) as well as the related journal publication. \r\n\r\nData overview:\r\nThe dataset is divided into:\r\n    • 2D and 3D folders\r\n    • Sandstone and Carbonate Datasets\r\n    • Combined shuffled Datasets\r\n    • High Resolution, 2x and 4x downsampled datasets using the Matlab imresize and imresize3 functions with default settings and randomised settings\r\n    • 2D HR images measure 800x800, cropped samples from the centre of the original cylindrical images, saved as PNG files\r\n    • 3D HR images measure 80x80x80, cropped from the centre of the original cylindrical images, saved as octave and scipy readable MAT files\r\n    • 800 images are available for training, 100 for validation, and 100 for testing.\r\n    • Shuffled subsets contain 1600 images for training, 200 for validation, and 200 for testing\r\n\r\nThe folder structure is as follows:\r\n    • DRSRD1/ – the parent folder\r\n    • DRSRD1/DRSRD1_2D/ – folder for all 2D data\r\n    • DRSRD1/DRSRD1_2D/sandstone2D – folder for 2D sandstone Data\r\n    • DRSRD1/DRSRD1_2D/carbonate2D– folder for 2D carbonate Data\r\n    • DRSRD1/DRSRD1_2D/shuffled2D – folder for 2D shuffled Data\r\nand similarly for the 3D dataset, found in ./DRSRD1/DRSRD1_3D/  under the exact same structure.\r\nWithin each carbonate, sandstone, and shuffled folder, the structure is as follows, using the 2D shuffled folder as example:\r\n    • /shuffled2D_train_HR/ – 0001.png, 0002.png, ..., 0800.png train HR images\r\n    • /shuffled2D_train_LR_default_X2/ -- 0001x2.png, 0002x2.png, ..., 0800x2.png train LR images, downscale factor x2\r\n    • /shuffled2D_train_LR_default_X4/ -- 0001x4.png, 0002x4.png, ..., 0800x4.png train LR images, downscale factor x4\r\n    • /shuffled2D_train_LR_unknown_X2/ -- 0001x2.png, 0002x2.png, ..., 0800x2.png train LR images, downscale factor x2\r\n    • /shuffled2D_train_LR_unknown_X4/ -- 0001x4.png, 0002x4.png, ..., 0800x4.png train LR images, downscale factor x4\r\n    • Validation\r\n    • /shuffled2D_valid_HR/ -- 0801.png, 0802.png, ..., 0900.png validation HR images\r\n    • /shuffled2D_valid_LR_default_X2/ -- 0801x2.png, 0802x2.png, ..., 0900x2.png train LR images, downscale factor x2\r\n    • /shuffled2D_valid_LR_default_X4/ -- 0801x4.png, 0802x4.png, ..., 0900x4.png train LR images, downscale factor x4\r\n    • /shuffled2D_valid_LR_unknown_X2/ -- 0801x2.png, 0802x2.png, ..., 0900x2.png train LR images, downscale factor x2\r\n    • /shuffled2D_valid_LR_unknown_X4/ -- 0801x4.png, 0802x4.png, ..., 0900x4.png train LR images, downscale factor x4\r\n    • Testing\r\n    • /shuffled2D_test_HR/ -- 0901.png, 0902.png, ..., 1000.png test HR images \r\n    • shuffled2D_test_LR_default_X2/ -- 0901x2.png, 0902x2.png, ..., 1000x2.png train LR images, downscale factor x2\r\n    • shuffled2D_test_LR_default_X4/ -- 0901x4.png, 0902x4.png, ..., 1000x4.png train LR images, downscale factor x4\r\n    • shuffled2D_test_LR_unknown_X2/ -- 0901x2.png, 0902x2.png, ..., 1000x2.png train LR images, downscale factor x2\r\n    • shuffled2D_test_LR_unknown_X4/ -- 0901x4.png, 0902x4.png, ..., 1000x4.png train LR images, downscale factor x4",
    "DRP-138.json": "This project presents the X-ray CT image sets obtained during depressurization of methane hydrate bearing sediments. Particularly, the imaging experiment aims on quantifying the extent of fines migration in sediments containing some fines due to depressurization. In this study, three sediments were tested as follows:\r\n\r\n(a) Ottawa 20-30 sand with 9%w/w silica silt\r\n(b) F110 sand with 11.5%w/w silica silt\r\n(c) F110 sand with 6%w/w kaolinite and 4%w/w silica silt.\r\n\r\nThese three are referred to as Sample#1, Sample#2, and Sample#3 in the files.\r\n\r\nEach experiment was divided into four steps:\r\n\r\n1. Gas injection\r\n2. Hydrate formation\r\n3. Water injection\r\n4. Depressurization\r\n\r\nThe details of this experiment can be found in the published paper below:\r\nGyeol Han, Tae-Hyuk Kwon, Joo Yong Lee, and Timothy J. Kneafsey (2018) \"Depressurization-induced fines migration in sediments containing methane hydrate: X-ray computed tomography imaging experiments\", Journal of Geophysical Research - Solid Earth, DOI:10.1002/2017JB014988.",
    "DRP-84.json": "An experimental microfluidic approach based upon image analysis of nitrogen displacing decane in a 500 μm  × 500 μm  × 1.5 μm micromodel experiment. The pressures on the boundary of the cell were changed and the system was observed as it dynamically relaxed to an equilibrium state. These images capture microscale equilibrium configurations that can be used to determine fluid saturations, interfacial areas, and curvatures.",
    "DRP-164.json": "We perform x-ray radiography and microtomography on rock specimens that are fractured at elevated confining stress conditions up to 30 MPa. We also concurrently measure stress and hydraulic conductivity. Metadata for this study is described in companion publications. LA-UR-18-27419.\r\n\r\nTo read these *.npy files using python 2.7:\r\n\"\r\nimport numpy as np\r\nimport pylab\r\nstack = np.load('BA01-05_3D_CT_python_array.npy')\r\nview = pylab.imshow(stack[300,:,:], cmap='gray')\r\npylab.show()\r\n\"",
    "DRP-471.json": "We conducted experiments on a Bentheimer sandstone rock to observe two-phase flow at steady-state. The experiments involved injecting oil and water at a consistent total flow rate while recording pressure drops at various fractional flow rates using high-precision differential pressure sensors. The capillary number for the experiments was 2.5E-7. To observe the flow patterns, we injected brine and decane at different water fractional flow rates ranging from 0 to 100%. We used a Zeiss XRM-510 X-ray microscope with a flat panel detector to scan the middle part of the sample three times with approximately 25 overlaps to acquire high-resolution images. The scans were taken at an X-ray energy and power of 80 keV and 6.5 W, respectively, with 2200 projections for each scan. Using the Zeiss Reconstructor Software, we performed three-dimensional image reconstructions. The scans were normalized and resampled using the Lanczos algorithm and stitched together to produce a complete image of the middle part of the sample at each fractional flow. The resolution of the image is 3.85 μm.",
    "DRP-133.json": "The characterization of carbonate rock structures poses a bigger challenge compared to siliciclastic rocks. This is mainly due to the complex physical and chemical diagenetic processes taking place during their formation. Savonnières limestone is an oolitic limestone which is made up of almost spherical grains called ooliths that are held together by cement-like material known as lime mud. Partitioning ooliths and lime mud as well as separating grains into individual ooliths can help in characterizing a variety of properties such as grain/oolith size distribution, as well as contribution of ooliths and lime mud to pore-wall roughness. When spatially correlated, the oolith size distribution can also give an idea about the formation and deposition of those rocks. Additionally, it can be used to correlate oolith sizes and lime\r\nmud thickness to the rock’s geomechanical properties under different stress conditions. The visualization steps followed in this entry include eliminating the jacket surrounding the rock sample and reducing the volume size to help in reducing computational time. The volume extracted is then filtered using anisotropic diffusion, followed by SNN filters to minimize noise while preserving the edges and image details. This step amplifies the difference between pores and solid, which is useful in binary segmentation, where solids are labelled 1 and pores are labelled 0. Next, the original micro-CT images are multiplied by the\r\nbinary segmented images to remove variation in pore spaces and show a stronger signal on the gradient image used in the watershed segmentation protocol. Watershed segmentation is used to separate ooliths from lime mud. Finally, a grain partitioning module is used to individually label each oolith, making the dataset ready for further rock structure analysis.",
    "DRP-21.json": "Sheared coal core: X-ray (100kV and 250µA), detector (7fps (frame per second) and average of 10 = exposure time per radiography of #1.4s), number of radiographies 1440 over 360°. Image: 1840x1840x1127 voxels, 16bit with a resolution (both voxel size and spot size) of 25µm.\r\nReconstruction method: FBP (Filtered Back Projection) --> Feldkamp method (cone beam geometry) with Tukey filter.\r\nDevice: Ultratom RXSolutions \r\nOperator: Nicolas Lenoir \r\nFacility Location: Laboratoire Navier <http://navier.enpc.fr/Microtomographe> \r\n\r\nPlease see Related Publications tab for more information.",
    "DRP-6.json": "A process-based multiscale network modeling approach is introduced to predict the drainage capillary pressure and relative permeability-wetting phase saturation curves at early cementation, final cementation and feldspar dissolution of the Wilcox tight gas sandstone. Predictions based on a two-scale analysis of an X-ray tomographic image are conducted as well but computational limitations make conclusions uncertain in this paper. We emphasize process-based modeling informed from thin sections as a cheap method of making a priori predictions of tight gas sandstone transport properties at various times in the paragenesis.",
    "DRP-125.json": "The datasets contain high resolution X-ray micro-tomographic images (raw, filtered and segmented) obtained after a drainage-imbibition cycle in a water-wet Ketton carbonate rock sample. Two subsets (SSa and SSb) were extracted from the tomographic images on which we have performed automatic effective contact angle measurements.\r\n\r\nFurther details for image analysis can be obtained from:\r\n\r\n1. Singh, K., Bijeljic, B. and Blunt, M.J. (2016). Imaging of oil layers, curvature and contact angle in a mixed-wet and a water-wet carbonate rock. Water Resources Research, 52, 1716-1728.\r\n\r\n2. Scanziani, A., Singh, K., Blunt, M.J., and Guadagnini, A. (2017). Automatic method for estimation of in situ effective contact angle from X-ray micro tomography images of two-phase flow in porous media. Journal of Colloid and Interface Science, 496, 51-59.",
    "DRP-172.json": "Micro CT images of waterflooding in a Bentheimer sandstone outcrop. \r\nImaged using 120 kV with 7 microns resolution.\r\n\r\nDry scan of the core before flooding\r\nScan after water flooding (at Sor state)",
    "DRP-324.json": "High-resolution X-ray micro-computed tomography (CT) data is required for accurate determination of rock petrophysical properties. High-resolution data, however, results in small field-of-view, thus the representativeness of simulation domain can be brought into question for geophysical applications. This project aims to develop new techniques for super resolution in digital rock petrophysics.",
    "DRP-236.json": "The micro-CT image data of Bentheimer sandstone used in characterizing its wettability. The porosity of the sample is 24.1%. The primary drainage and imbibition experiments were performed by using air and brine. The images were acquired at irreducible air saturation Sw=94%. This dataset is used to characterize wetting in complex subsurface multiphase systems by using principles of topology and integral geometry.\r\n\r\nThe nc files can be read in ImageJ software via NetCDF plugins (http://www.unidata.ucar.edu/software/netcdf/).",
    "DRP-304.json": "Micro-computed tomography TIFF stacks of a Mt. Simon core at residual conditions. The core is from a depth of 6,926 ft, the sub-sample tested is 0.25 inch diameter by 1 inch length. This data was used to complete contact angle measurements and analyze the influence of clay-rich regions in the pore space on residual trapping efficiency.",
    "DRP-83.json": "X-ray tomography is a powerful tool giving access to the morphology of biofilms, in 3D\r\nporous media, at the mesoscale. Due to the high water content of biofilms, the\r\nattenuation coefficient of biofilms and water are very close, hindering the distinction\r\nbetween biofilms and water without the use of contrast agents. Until now, the use of\r\ncontrast agents such as barium sulfate, silver-coated micro-particles or\r\n1-chloronaphtalene added to the liquid phase allowed imaging the biofilm 3D\r\nmorphology. However, these contrast agents are not passive and potentially interact\r\nwith the biofilm when injected into the sample. Here, we use a natural inorganic\r\ncompound, namely iron sulfate, as a contrast agent progressively bounded in dilute or\r\ncolloidal form into the EPS matrix during biofilm growth. By combining a very long\r\nsource-to-detector distance on a X-ray laboratory source with a Lorentzian filter\r\nimplemented prior to tomographic reconstruction, we substantially increase the contrast\r\nbetween the biofilm and the surrounding liquid, which allows revealing the 3D biofilm\r\nmorphology. Two key advantages of the newly proposed method are that passive addition \r\nof iron sulfate maintains the integrity of the biofilm prior to imaging, and that the biofilm itself\r\nis marked by the contrast agent, rather than the liquid phase as in other available methods.\r\nThe iron sulfate method presented can be applied to understand biofilm development and\r\nbioclogging mechanisms in porous materials and the obtained biofilm morphology could be an ideal\r\nbasis for 3D numerical calculations of hydrodynamic conditions to investigate biofilm-flow coupling.\r\n\r\n- The following data sets are all data sets used in Carrel et al. (2017, PLOS ONE).\r\n\r\n- The Lorentzian filter used in this study is available from the folder of the first data set. \r\n\r\nFigure A shows the nafion grains forming the porous medium used in the current study.\r\nFigure B shows the same porous medium after biofilm culturing.",
    "DRP-353.json": "More than 3000 individual detrital magnetite grains from a fanglomerate near Whitewater (California, USA) were scanned using microCT. These data were used to detect mineral inclusion in these magnetite grains, which can contribute significant amounts of 3He. Grains without inclusions were then picked from these analyzed grains and used to calibrate the cosmogenic 3He production rate in magnetite (manuscript submitted to GChron).",
    "DRP-216.json": "X-ray CT scans of apatite crystals, for the purpose of supporting (U-Th)/He thermochronometry by measuring size, shape, and corrections for alpha particle ejection during radioactive decay.",
    "DRP-345.json": "The figure displays the visual evolution of scCO2 ganglion, the average geometric contact angle along different grain surfaces, and the change in strain between two drainage-imbibition (D-I) cycles for three separate ganglion trapped in different pore spaces. These plots show the scCO2 trapped in a Bentheimer sandstone core (A) advanced along the pore network, decreased in volume, and initially was in contact with six surfaces which reduced to four surfaces after the second D-I cycle. The average contact angle increased along two grain surfaces of contact and slightly decreased along the other two surfaces appearing to reach a new state of equilibrium where the strain slightly decreased after the second D-I cycle. With the scCO2 migration, the immediate surrounding pore geometry changed and thus a change in contact angle along the advancing and receding ends occurred. The ganglion trapped in a Nugget sandstone pore (B) increased in volume after the second D-I cycle. Five surfaces of contact were present between cycles with contact angles remaining constant along two surfaces and increasing along the remaining three surfaces. The pore-filling occurrence increased the local strain while the ganglion trapped in a dead-end pore in the Nugget sandstone (C) remained consistent in volume, number of contact surfaces, and the average contact angle along each surface remained unchanged. These observations show how changes in the trapped scCO2 curvature can influence continued migration or promote more permanent residual trapping.",
    "DRP-328.json": "This data is micro-CT images of the simultaneous injection of hexadecane and brine into a porous carbonate rock (Estaillades). The images were acquired during steady-state, which was deduced from a plateau in the differential pressure across the sample. The experiments were conducted in the capillary dominated regime (the total flow rate was kept constant at 0.1 ml/min, with the fractional flow (fw) changed in sequence 0.85fw, 0.7fw, 0.5fw, 0.25fw, 0fw). The data set includes the tomograms and segmented data for a 1000x1000x1000 voxel cube (voxel size = 3.9 microns). This data set is described in detail in the publications: https://doi.org/10.1103/PhysRevE.100.043115 and  https://journals.aps.org/pre/abstract/10.1103/PhysRevE.100.043103",
    "DRP-16.json": "Some standard datasets from the Network Generation Comparison Forum:\r\n\r\nhttp://people.physics.anu.edu.au/~aps110/network_comparison/\r\n\r\nThanks to Gerd Schroeder-Turk (Curtin University), Jill Middleton and Holger Averdunk (ANU)",
    "DRP-283.json": "In this study, we examined a syntaxial vein contained in a shale mudrock. Specimens were obtained from Weatherford (Houston, TX, U.S.A.) and had come from a core sample (depth of ~10,400 ft) in the Upper Wolfcamp formation, a hydrocarbon source rock in the Permian basin (Texas, U.S.A.). The mudrock is roughly half quartz with the remainder comprising clay minerals (primarily illite), plagioclase and carbonates.  The specimen featured in this project was about 2 cm in length and it contained a vein that was about 5 mm thick. \r\n\r\nIn addition to the xCT analyses, 2D analyses (SEM-BSE-QEMSCAN, XRF) and powder XRD were done to identify the minerals in the vein and to quantify their relative amounts. These methods revealed that the first minerals to have precipitated (adjacent to the original fracture wall) were elongate crystals of dolomite as large as 900 microns. These crystals were overlain with a mixture of smaller carbonate crystals including calcite and iron-rich dolomite, interspersed at spatial scales as small as 5 microns. Precipitation of SiO2 was found to fill some of the void space. Quantitative analysis of the segmented 3D xCT image indicated that the vein volume is filled with 62% elongate dolomite crystals, 33% mixed dolomite and calcite, 1% silica, and 4% vuggy void space. Synchrotron X-ray scattering revealed that the vein mineral precipitates had porosity of ~1% and this is much less than the matrix rock porosity.\r\n\r\nThis project was a partnership between Princeton University, the National Energy Technology Lab, the Ohio State University, and Oak Ridge National Lab.\r\n\r\nWe thank Alan Kornacki of Weatherford for providing rock samples that contain mineral-filled veins. Initial work by researchers at OSU and ORNL were funded as part of the Center for Nanoscale Controls on Geologic CO₂ (NCGC), an Energy Frontier Research Center funded by the U.S. Department of Energy (DOE), Office of Science, Basic Energy Sciences (BES), under Award #DE-AC02-05CH11231. Analysis and writing by OSU and ORNL researchers was supported by the U.S. Department of Energy, Office of Science, Office of Basic Energy Sciences, Chemical Sciences, Geosciences, and Biosciences Division. We also acknowledge Johnathan Moore, Laura Dalton, and Bryan Tennant of the National Energy Technology Laboratory (NETL) in Morgantown, WV for their assistance with XCT scanning.\r\n\r\nAdditional xCT scanning data is available at https://edx.netl.doe.gov/ which is NETL's online system for data archiving. The public link for this project is: https://edx.netl.doe.gov/dataset/computed-tomography-scans-of-naturally-mineralized-fractures-in-upper-wolfcamp-shale .",
    "DRP-41.json": "Two-fluid phase configurations in a periodic random close packing of spheres with porosity 0.369. This data set contains equilibrium fluid configurations obtained using the lattice Boltzmann method based on randomly initialized distribution of phases for a variety of fluid saturations. Data sets are labeled with the initial fluid saturation (sw_XX) and the whether a connected (a) wetting phase or (b) non-wetting phase was used to determine the initial fluid configuration.  For additional details on the data set, please refer to McClure et al. (2016) (currently under review at Physical Review E). For all data sets, the phases are labeled as: solid (0), Non-wetting (1), and wetting (2).",
    "DRP-295.json": "This project includes 2 time-resolved X-ray microtomography experiments performed in glass bead packs. The two datasets are differentiated by the flow condition controlling each experiment, non-equilibrium (nonEq) and quasi-equilibrium (quasiEq). Each dataset includes segmented images comprising primary drainage (PD), main imbibition (MI), main drainage (MD), and a few scanning imbibition (SI) and drainage (SD) curves. The quasiEq data also includes some interfacial relaxation data. The tomographic images were collected with a 3.2 um voxel resolution and a scanning time of 14 s (variable temporal resolution between scans of 1-5 min).The data was collected on GSECAR's 13-BM-D beamline at the Advanced Photon Source (APS), Argonne National Laboratory (ANL).  Further information on the experimental methods can be found in Meisenheimer et al. (2020). The data was collected to investigate the effect of interfacial relaxation present in quasi-equilibrium conditions on macroscopic invariants (i.e. wetting saturation, average capillary pressure, specific interfacial area, and Euler characteristic) and their constitutive relationships (e.g. Pc-Sw-anw).",
    "DRP-57.json": "This is a set of 3D models resembling Fontainebleau sandstones. They were created using the commercially available software e-Core. We used identical grain sedimentation, compaction and diagenetic process parameters for seven model reconstructions. Porosity levels between 8% to 26% were obtained by only varying the amount of quartz cementation.",
    "DRP-503.json": "The database consists of a total of 16 samples of carbonate rocks from the Brazilian Pre-Salt. The samples come in two distinct sizes: those with a 2.54 centimeters in diameter correspond to sidewall samples, while those with a 3.81 centimeters in diameter are represented by plugs. In this database, each sample has two different resolutions: high and low. For the sidewall samples, the high resolution is 6 micrometers (µm) and the low resolution is 48 µm. For the plug samples, the high resolution is 8 µm, while the low resolution is 64 µm. \r\nThe database comprises grayscale images that have been processed, filtered to reduce artifacts, registered, and cropped. Additionally, it includes segmented files obtained through the Otsu and Watershed methods, enabling a detailed and accurate analysis of sample characteristics. Thus, the dataset consists of a total of 32 grayscale image files. With the inclusion of segmented images, the dataset expands to a total of 64 files, where each original image has a corresponding segmented version into pore and matrix, totaling 32 additional files.\r\nAll the rocks  were acquired using the Ge X-ray emission microtomography equipment, model VTomex M. These microtomography scans were acquired at low resolution (48 and 64 µm) with the following the parameters: energy (150 kV), current (250 µA), average (3), skip (1) and filter (0,15 mmCu). And high resolution  (6 and 8 µm)  with the following the parameters: energy (140 kV), current (140 µA), average (6), skip (1) and filter (0,15 mmCu).\r\nThis dataset offers a wide range of petrophysical, geological, and artificial intelligence applications. Among the petrophysical applications, highlights include porosity and permeability analysis, characterization of rock connectivity and heterogeneity, and simulations of more advanced properties on high-resolution images, such as acoustics, wettability, and relative permeability.\r\nFor geology, high-resolution images are particularly useful for investigating the diagenetic processes that impact the rock over time, such as cementation and mineral dissolution. The images allow for a three-dimensional visualization of the texture and internal structure of rocks, facilitating the analysis of mineral distribution, fractures, and heterogeneities. On the other hand, low-resolution images serve the purpose of providing information about the overall distribution of these minerals and components over a broader area.\r\nArtificial intelligence further enhances the utility of the dataset through various applications. Image classification algorithms can automatically categorize rock samples based on their resolution and segmentation into pore and matrix files, streamlining dataset organization and analysis.",
    "DRP-256.json": "High resolution SEM images of samples from a UK North Sea sandstone oil reservoir. The sandstones are Jurassic and Triassic age. The reservoir was buried to a depth of circa 2500 m and has been exposed to significant diagenesis resulting in substantial cements, clays and secondary porosity from partial grain dissolution. The diagenesis has created a complex pore space with a wide range of pore sizes.",
    "DRP-344.json": "This data is micro-CT images of the simultaneous injection of decane and brine into a porous carbonate rock (Estaillades). The images were acquired during steady-state, which was deduced from a plateau in the differential pressure across the sample. The experiments were conducted in the capillary dominated regime (the total flow rate was kept constant, with the fractional flow (fw) changed in sequence 0.85fw, 0.7fw, 0.5fw, 0.25fw, 0fw). The total flow rate was kept constant at 0.02ml/min. The data set includes the tomograms and segmented data for a 1000x1000x1000 voxel cube (voxel size = 3.6 microns). This data set is described in detail in the publications: https://doi.org/10.1103/PhysRevE.100.043115 and https://journals.aps.org/pre/abstract/10.1103/PhysRevE.100.043103",
    "DRP-352.json": "This dataset contains the pore-scale simulated geometries and corresponding flow fields for a bead pack under CO2-induced dissolution. The objective is to investigate how the average dissolution rates respond to changes in the flow regime and micro-structure of the rocks.",
    "DRP-305.json": "Mt. Simon sandstone core extracted from the Illinois Basin. The sample dimensions are 2.9mm in diameter x 3.5 mm in length with a porosity of 0.134, which was imaged using micro-CT with a resolution of 1.74 micron / voxel. QEMSCAN analysis was performed for polished thin sections, which was then registered to the 3D image to generate a detailed map of the mineral structure. Minerals aggregated into groups and labeled as clay, quartz, feldspar, micas, and other high density minerals.",
    "DRP-169.json": "Medical CT scans of 38 cores from Site Keathley Canyon 151 in the northern Gulf of Mexico drilled by the Gas Hydrate Joint Industry Project led by Chevron in 2005. Please see Winters et al 2008 (https://doi.org/10.1016/j.marpetgeo.2008.01.018) for description of physical properties of sediments and drilling location. \r\n\r\nSamples were scanned at the National Energy Technology Laboratory in 2011 after hydrates had dissociated.  The scans were collected using a Universal Systems 350 HD medical CT scanner with a voxel resolution of 0.25 mm x 0.25 mm x 1 mm. Original data in *.250 file format (raw) as 16 bit signed data in a 512x512 field and with a header offset of 8192 bytes.",
    "DRP-372.json": "Physical processes in porous materials are of research interest due to their inherent geometric complexity. The equations that describe these processes are well-understood; however, approximating them numerically often requires extensive computational resources. \r\nHere we present transport simulation results and geometric features carried-out on samples hosted on the Digital Rocks Portal.  We hope that the scale and diversity of this dataset can offer unparalleled opportunities to researchers who are benchmarking simulators, training machine learning models, and developing correlations to acquire new insights into physical processes in porous media.\r\n\r\nSample names follow the convention:\r\nDigitalRocksPortalProjectNumber_SampleNumber_Size\r\n\r\nVersion 1.0\r\n-------------\r\nThis version includes 2563 and 4803 volumes that were sampled from binary images hosted on the DRP. Slip flow (at 5 confinement pressures), single-phase LBM, and electrical simulations were performed on each sample. We also include ten features and four Minkowski functionals to characterize the geometry of the void space.\r\n\r\n----------------------------\r\nLoad data in Python:\r\n----------------------------\r\nfrom hdf5storage import loadmat\r\nfrom pandas import read_csv\r\n\r\n# Load binary, simulation results, and features (.mat) as 3D Numpy array\r\nmat_data    = loadmat('<FILENAME>.mat')['<KEY>']\r\n\r\n# Load Minkowski Functionals (.csv) as Pandas dataframe\r\nmf   =  read_csv('<FILENAME>.csv', delimiter=’ ’)\r\n\r\n----------------------------\r\nLoad data in Matlab:\r\n----------------------------\r\n% Load binary, simulation results, and features (.mat)\r\nload('<FILENAME>.mat')\r\n\r\n% Load Minkowski Functionals (.csv) as table (access variables with mf.<KEY>)\r\nmf   =  readtable ('minkowski.csv')\r\n\r\n----------------------------\r\nFilenames and Keys:\r\n----------------------------\r\nPlease see the Readme file on our repo for a table of filenames, keys, and data descriptions:\r\nhttps://github.com/je-santos/Large-simulation-dataset\r\n\r\n\r\nFor comments/inquiries/suggestions use the issues tab of our repo:\r\nhttps://github.com/je-santos/Large-simulation-dataset",
    "DRP-276.json": "In this project, we used a D3Q19 LBGK lattice Boltzmann model (LBM) to simulate water adsorption and condensation in a 3D reconstructed clay pore structure based on BIB-SEM images analysis. The subsequent methane flow as a function of water saturation was simulated using a MRT local effective viscosity (LEV) LBM. Different surface wettability conditions are considered including a water-wet case, a water-repellent case and a mixed-wet case. \r\n\r\nThe dataset includes:\r\n1) the original reconstructed clay geometry file (binary where 0-pore space and 1-solid clay), \r\n2) the clay/liquid water/pore space geometry files after water adsorption simulation at five water saturation values (0-pore space, 1-solid clay, 3-condensed water), \r\n3) the velocity fields of methane flow at Sw=0 with or without consideration of slip flow at the solid boundary\r\n4) the velocity fields of methane flow at three water saturation values.",
    "DRP-299.json": "The data provided here is used to investigate the representative elementary volume (REV) size directly from grayscale micro-CT images of porous media of sandstone and carbonate. Three datasets are provided per sample: 16-bit grayscale image, 8-bit grayscale image, and segmented image. The re-quantization of a 16-bit grayscale image to 8-bit is carried out using ImageJ. The choice of intensities used carrying out this operation is provided in the supplementary information of the related publication. \r\n\r\nThis dataset includes:\r\n1) Sand pack\r\nImage size: 600^3 voxels\r\nResolution: 5.2 micrometer\r\nImaging Facility Used: Tyree x-ray imaging (https://www.engineering.unsw.edu.au/minerals-energy-resources/facilities/tyree-x-ray)\r\nPorosity: 35.4%\r\nAverage Permeability: 48.72 D\r\n\r\n2) Bentheimer Sandstone\r\nImage size: 600^3 voxels\r\nResolution: 5.4 micrometer\r\nImaging Facility Used: Tyree x-ray imaging (https://www.engineering.unsw.edu.au/minerals-energy-resources/facilities/tyree-x-ray)\r\nPorosity: 23.9%\r\nAverage Permeability: 4.27 D\r\n\r\n3) Fieldstone\r\nImage size: 500^3 voxels\r\nResolution: 4.98 micrometers\r\nData Source: This is a subset of the dataset provided at https://www.digitalrocksportal.org/projects/297\r\nPorosity: 20%\r\nAverage Permeability: 0.993 D\r\n\r\n4) Ketton Carbonate\r\nImage size: 600^3 voxels\r\nResolution: 5 micrometer\r\nData Source: This is a subset of the dataset provided at https://www.digitalrocksportal.org/projects/167\r\nPorosity: 10%\r\nAverage Permeability: 1.27 D",
    "DRP-333.json": "The present contribution aims to understand the effect of Computed Tomography (CT) acquisition settings on digital rock physics models. \r\n\r\nWe conducted 32 scans of 4 Berea Sandstone samples. In order to understand the effects of setup parameters on the calculated density of the samples, each scan had different set up conditions. We also varied post acquisition filtering, including applying different beam hardening corrections, and various noise filters. \r\n\r\nWe observe that by using phantoms of known density scanned alongside our samples, we can calibrate CT attenuation to density in most circumstances. X-ray source current, numerical noise filtering, exposure time, number of projections, and numerical bit size seem to have a little effect on the final density estimation. Scans with very low source voltages (<80 kV), as well as some with physical copper filtering over the X-ray source, may not be effective for physical property estimations.\r\n\r\n We also found that density estimations are only accurate if a specific, and unique, beam hardening correction is applied. We observed that when the beam hardening correction is properly selected, the R2 of the CT-number to density calibration curve is above 0.999 and density estimates are accurate. Scans that cannot be used for accurate property estimations can be easily identified using this metric.",
    "DRP-221.json": "This dataset was used in the study of Van Offenwert et al. (2019). It contains time-resolved laboratory-based micro-CT images of saturated solute injection experiments in sintered glass and Bentheimer sandstone. Based on the grey values in the resolved pore space, pore-scale concentration fields can be quantified. To estimate its uncertainty, calibration scans where the pores were saturated with a known tracer (CsCl) concentration were performed at 12 s per scan with a voxel size of 13 µm ('Calibration experiments'). The tracer injection experiments were imaged at 15 s per scan with a voxel size of 13.4 µm (‘Tracer injection experiments’). Each fast imaging experiment was preceded by a higher quality slower pre-scan to determine the static pore structure. All data were acquired with a gantry-based micro-CT system specially designed for in-situ imaging (UGCT). The aim was to analyze pore-scale solute concentration fields to investigate solute spreading and mixing during tracer injection experiments. Further details on the analyses of the micro-CT images can be found in Van Offenwert et al. (2019). The dataset can be used to investigate the influence of pore-scale heterogeneity and the volumetric pump velocity (the Péclet number) on transport processes.",
    "DRP-364.json": "This dataset contains segmented X-Ray micro-tomography images, where voxel length was 5.3 um, of a steady-state three-phase flow experiment conducted in a water-wet Bentheimer sandstone.  Full details of the experimental setup, procedure and imaging analysis can be found in the paper 'Disconnected Gas Transport in Steady-State Three-Phase Flow Revealed with X-ray Imaging' that is referenced in Related Publications. and supporting material. \r\n\r\nThe steady-state experiment was combined with pore-scale imaging to allow for the simultaneous determination of three-phase relative permeability and local capillary pressures. In the experiment, the impact of a saturation history, where gas fractional flow is first increased (Drainage) and then decreased (Imbibition) with respect to water and oil fractional flows, on three-phase relative permeability is investigated. \r\n\r\nThe three-phase steady-state imaging experiment was performed on a Bentheimer sandstone of diameter 1.26 cm, and length 4.23 cm. The selected sample has a total porosity of 0.24. The absolute permeability (k) of the sample, measured at the experimental conditions, is 1.75 ± 0.03 D (1.73×10-12 ± 0.03×10-12 m2). The experiment was conducted at ambient temperature and pore pressure of 1 MPa. Nitrogen (N2) was used as the gas phase, n-decane (C10H22) as the oil phase, and deionized water (H2O) as the aqueous phase. Both oil and water were doped to enhance their contrast in the pore-scale images. Scans are performed with a Zeiss Versa 510 X-Ray microscope with a flat panel detector and various microscope objectives.\r\n\r\nThere are 12 images in this dataset:\r\n\r\n1. A dry scan of the sample \r\n2. A water saturated scan (absolute permeability was measured here)\r\n3. An oil injection scan (primary drainage)\r\n4. A two-phase co-injection of oil and water at fw,o = 0.5. \r\n5. A three-phase co-injection of gas, oil and water at fg= 0.5, and fw,o=0.25 (drainage)\r\n6. A three-phase co-injection of gas, oil and water at fg= 0.75, and fw,o=0.125 (drainage)\r\n7. A gas injection only scan fg=1\r\n8. A three-phase co-injection of gas, oil and water at fg= 0.75, and fw,o=0.125 (imbibition)\r\n9. A three-phase co-injection of gas, oil and water at fg= 0.625, and fw,o=0.1875 (imbibition)\r\n8. A three-phase co-injection of gas, oil and water at fg= 0.5, and fw,o=0.25 (imbibition)\r\n10. A three-phase co-injection of gas, oil and water at fg= 0.375, and fw,o=0.3125 (imbibition)\r\n11. A three-phase co-injection of gas, oil and water at fg= 0.25, and fw,o=0.375 (imbibition)\r\n \r\n\r\nIn the segmented images:  \r\n1 is water\r\n2 is rock\r\n3 is oil \r\n4 is gas\r\n\r\nAll images are of size 2000x2000x5000 voxels.\r\n\r\nTo obtain the raw grey-scale images, please contact the author directly on Abdulla.alhosani17@imperial.ac.uk.",
    "DRP-523.json": "A North Sea sandstone with 23% porosity and 640 mD permeability was cleaned with solvents, dried at 60°C, and imaged using micro-CT at a 2.3 μm resolution over 22 hours. It was then cut, resin-impregnated, polished, and carbon-coated for 2D mineral mapping using SEM-EDS with QEMSCAN at a 2.0 μm resolution. The 2D mineral map was registered to the 3D micro-CT image, and minerals were segmented into seven groups based on X-ray intensity, though some minerals with similar attenuation could not be fully distinguished.\r\n\r\nThe data is uploaded as 4 netCDF blocks that combine into a full 3D data set of 1,000^3. Full details are provided in the netCDF header files. \r\n\r\nThe segmented domain is associated with LBPM (https://github.com/OPM) simulations results available at https://zenodo.org/records/13836047",
    "DRP-98.json": "This project includes porosity images and steady-state water saturation images at 8 different positions (distance from inlet are 4, 12, 20, 28, 37, 44, 52 and 59 cm) along a 60-cm long Berea sandstone core (45 mD) during three primary drainage experiments conducted at 40C & 12 MPa, 40C & 8.3 MPa, and 60C & 12 MPa.\r\n\r\nThe drainage experiment starts with injecting 1:1 volume ratio of CO2 and brine. After steady state is reached, the water fractional flow (fw) is lowered. This is repeated until 100% CO2 injection. Each drainage experiment has three steps with fw of 0.5, 0.1 and 0.\r\n\r\nThis project has high-resolution images that were used to produce Figure 2 in Chen et al. 2017, Water Resource Research:\r\nhttp://onlinelibrary.wiley.com/doi/10.1002/2017WR020810/full",
    "DRP-20.json": "Intact coal cores: X-ray (100kV and 250µA) with a 0.1mm filter of Cu to reduce beam hardening effect, detector (5fps (frame per second) and average of 10 = exposure time per radiography of #2s), number of radiographies 1440 over 360°. Image: 1634x1634x4115 voxels, 16bit with a resolution (both voxel size and spot size) of 25µm.\r\nDevice: Ultratom RXSolutions\r\nOperator: Nicolas Lenoir\r\nFacility Location: Laboratoire Navier <http://navier.enpc.fr/Microtomographe> \r\n\r\nRelated publications (https://scholar.google.com/citations?user=WpKx-qgAAAAJ&hl=en):",
    "DRP-7.json": "X-ray microtomography image of texturally equilibrated salt. Details of the experiments, imaging and image analysis can be found in the paper:",
    "DRP-36.json": "The objective of this study was to obtain quantitative evidence of pore-scale immiscible fluid distribution in oil-wet and water-wet porous media using X-ray computed microtomography. Raw CMT image data sets for multiple flooding experiments using kerosene and brine are included for an oil-wet polyethylene bead pack, and a single imbibition/drainage cycle for a water-wet glass bead pack.",
    "DRP-234.json": "The dataset contains fluid phase distribution obtained from high-resolution drainage simulations in both a heterogenous micromodel and Bentheimer sandstone. The purpose is to investigate the influence of inertial effects on scCO2-brine displacement in complex geometries, where scCO2 is much less viscous than brine or oil meaning that the inertial effects may not be negligible. The direct numerical simulations in this work employ the continuum-surface-force based color-gradient multiple-relaxation-time lattice Boltzmann model combined with a geometrical wetting model. The inertial effects are investigated by varying the Ohnesorge number (Oh) while keeping other conditions the same.\r\n\r\nA manuscript from this work has been submitted to a journal and is currently in revision. \r\n\r\n1). Dataset from Bentheirmer sandstone simulations\r\nThe geometry of the Bentheimer sandstone is from Herring et al., 2016, where the original data size is 1920*1920*1200 with a voxel resolution of 3.182 micron. A subdomain is cropped from the original data (porosity: 0.19), resulting in a simulation grid of 720*720*900 with a grid resolution of 3.182 micron. The simulation conditions are as follows:\r\ncase 1: Ca=2.0e-6, Oh=2.23e-3\r\ncase 2: Ca=2.0e-6, Oh=5.57e-3\r\ncase 3: Ca=2.0e-6, Oh=11.14e-3\r\ncontact angle: 30 degree \r\nviscosity ratio: 37.7 (nonwetting phase is less viscous)\r\ndensity ratio: 1\r\n\r\nFluid phase distribution data (location and order parameter value) at the breakthrough time from the above three cases are provided.\r\n\r\n2). Dataset from micromodel simulations\r\nThe geometry of the micromodel is from Li et al., 2017, where the original 2D scan is 11275*8460 with a voxel resolution of 0.630 micron. The simulation grid, 1953*13*2640 is constructed from resized 2D scan image (porosity: 0.49), with a grid resolution of 2.727 micron. The simulation conditions are as follows:\r\ncase 1: Ca=2.6e-5, Oh=2.177e-3\r\ncase 2: Ca=2.6e-5, Oh=11.62e-3\r\ncontact angle: 10 degree \r\nviscosity ratio: 13.2 (nonwetting phase is less viscous)\r\ndensity ratio: 1\r\nFluid phase distribution data (2D gap-averaged saturation and location on the 2D plane) after one pore-volume injection from the above two cases are provided.\r\n\r\nThe geometry data (solid points location) used in all simulations can be derived from the fluid phase distribution data.\r\n\r\n1. Herring, Anna L., Linnéa Andersson, and Dorthe Wildenschild. \"Enhancing residual trapping of supercritical CO2 via cyclic injections.\" Geophysical Research Letters 43, no. 18 (2016): 9677-9685.\r\n2. Li, Yaofa, Farzan Kazemifar, Gianluca Blois, and Kenneth T. Christensen. \"Micro‐PIV measurements of multiphase flow of water and liquid CO2 in 2‐D heterogeneous porous micromodels.\" Water Resources Research 53, no. 7 (2017): 6178-6196.",
    "DRP-326.json": "The dataset provides simulated two-fluid distributions generated by an open-source lattice-Boltzmann fluid solver LBPM, (https://github.com/OPM/LBPM). Direct pore scale simulations were performed with a Bentheimer sandstone sample uploaded by Laura Dalton (https://www.digitalrocksportal.org/projects/218). \r\n\r\nThe mixed-wet two-fluid flow simulation was initialized from a morphological drainage with a residual water saturation Swi=0.08; all solid voxels in contact with oil were assigned to different wetting conditions while a strongly water-wet condition was assigned to the solid surface in contact with water, which mimics an aging process. Then simulations of steady-state relative permeability coupled by the dedicated morphological tools (detailed in Related Publications) were performed. The dataset provides the fluid distributions at three representative water saturation for different wetting conditions.\r\n\r\nThe dataset consists of two parts: (1) unsteady state imbibition after morphological drainage; (2) steady-state relative permeability simulations with morphological algorithms embedded.",
    "DRP-263.json": "Segmented images of the imbibition process for a mixed-wet Bentheimer sandstone at different fractional flows at steady state.\r\n\r\nThe data can be loaded in Fiji (ImageJ), please download the instruction for more details.\r\n\r\nReference:\r\nLin, Q., Bijeljic, B., Berg, S., Pini, R., Blunt, M.J., Krevor, S., 2019. Minimal surfaces in porous media: Pore-scale imaging of multiphase flow in an altered-wettability Bentheimer sandstone. Phys. Rev. E 99, 063105. doi:10.1103/PhysRevE.99.063105",
    "DRP-58.json": "Estaillades carbonate is a mono-mineralic, calcitic rock, which contains two types of pores: intergranular macropores and intra-granular micropores. An Estaillades sample with a diameter of 7mm was scanned with UGCT’s HECTOR micro-CT scanner (developed in collaboration with XRE, www.xre.be). In this micro-CT scan, (most of) the intergranular macropores are resolved, while the micropores are not. A three-phase segmentation consisting of pore voxels, voxels with unresolved porosity, and solid voxels is provided. This image was used to extract a multi-scale pore network model from (Bultreys et al. 2015).",
    "DRP-330.json": "This data is micro-CT images of the simultaneous injection of nitrogen and brine into a porous carbonate rock (Estaillades). The images were acquired during steady-state, which was deduced from a plateau in the differential pressure across the sample. The experiments were conducted in the capillary dominated regime (the total flow rate was kept constant, with the fractional flow (fw) changed in sequence 0.85fw, 0.7fw, 0.5fw, 0.25fw, 0.03fw, 0fw). There is the high Ca experiment where the total flow rate was kept constant at 0.8ml/min and a low Ca experiment where the flow rate was kept constant at 0.1ml/min.  The data set includes the tomograms and segmented data for a 1000x1000x1000 voxel cube (voxel size = 3.9 microns). This data set is described in detail in the publications: https://doi.org/10.1103/PhysRevE.100.043115 and https://journals.aps.org/pre/abstract/10.1103/PhysRevE.100.043103",
    "DRP-367.json": "The dataset contains a series of images of a varying-depth converging-diverging single-channel micromodel during ferrofluid flooding without and then with an external magnetic field. One image shows the initial oil saturation after ferrofluid flooding without a magnetic field, and twelve images show the oil saturation after the magnetic field was turned on. Only eight pores in the flow channel are shown in these images, while there are more than 100 pores in the flow channel. The flow direction is from right to left. The bright non-wetting phase is the oil and the dark wetting phase is the ferrofluid. The time of the image is marked in the file name, with the time rounded to the nearest half-hour. The injection rate is 0.1 microliter per hour, or 3.0 pore volumes per hour, where the latter is evaluated by the total pore volume of the whole micromodel.\r\n\r\nSee 'related publications' tab for codes  and details.",
    "DRP-222.json": "Dataset: Sandstones (Bentheimer, Doddington, and Rotleigend)\r\nX-Ray Microscopy (XRM) is used to examine the intergranular pore structures in a series of sandstones. All three sandstone samples are imaged using a ZEISS Versa X-ray Microscope (XRM) (ZEISS X-Ray Microscopy, Pleasanton, CA). 3D volumes of the varying resolution are reconstructed from a series of 1600 projections, sequentially acquired at evenly spaced angular increments during a 360° rotation. Each projection consists of 1024 x 1024 pixels and is reconstructed into a 3D volume of size 1024 x 1024 x 1024 voxels. These are then cropped into maximally inscribed cubes from the cylindrical reconstructed volumes and segmented using ZEISS Zen Intellesis machine learning based segmentation (Andrew, 2018).",
    "DRP-170.json": "Sedimentary-relief peels from field environments have been a primary observational technique for decades. Hundreds (likely thousands) of specimens of variable quality exist, representing a wide range of acquisition techniques, and depositional processes and sedimentary environments (e.g., Martinius and van den Berg, 2011). Peels are traditionally used to recognize and explain depositional processes and sedimentary textures qualitatively. This project is an effort to digitally capture sedimentary heterogeneity information represented by these unique specimens that are larger than core-scale, but smaller than reservoir simulation cell size. Digitally capturing this information allows for diverse quantitative analyses or application to flow simulation.",
    "DRP-259.json": "An image analysis workflow was used to study the electron microscopy images of uncemented muds obtained at various depths (< 1.1 km burial) in the Kumano Basin of Nankai Trough offshore Japan for studying the silt bridging phenomenon. \r\nForty-nine images from five core samples at different depths of Site C0002 obtained during Integrated Ocean Drilling Program (IODP) Expeditions 315 and 338 were used for the study. The original image set can be found at https://www.digitalrocksportal.org/projects/42.\r\nThe selected mudrock images were filtered and segmented to identify the individual pores and silt size grains before statistical analysis. The images in the dataset have been classified according to depth: 19, 202, 401, 600 and 836 meters below seafloor (mbsf), with each individual set having 1 original image, 1 segmented image with pores overlaying the original image, and 1 image of separated pores, silt size grains and clay.\r\n\r\nAdditional information on the drilling sites for Expeditions 315 and 338 can be obtained from the following links:\r\nhttp://publications.iodp.org/preliminary_report/315/\r\nhttp://publications.iodp.org/preliminary_report/338/\r\nhttp://publications.iodp.org/proceedings/314_315_316/314315316toc.htm\r\nhttp://publications.iodp.org/proceedings/338/338title.htm\r\nhttp://publications.iodp.org/proceedings/314_315_316/314315316bib.htm\r\nhttp://publications.iodp.org/proceedings/338/338bib.htm",
    "DRP-218.json": "Two sets of Bentheimer and Nugget Sandstone X-ray computed tomography data at residual conditions after an initial and additional drainage-imbibition cycle and three segmented pore types. Scans were completed at 1.66 micron/voxel.",
    "DRP-35.json": "Rock sample obtained from an Austin Chalk Formation outcrop.",
    "DRP-189.json": "The aim of this experimental study is to investigate the impact of wetting characteristics on multiphase flow, sweep efficiency, and residual fluid distribution in unconsolidated porous media. A sequence of oil and water injections was performed on bead packs with uniform porosity and permeability, but different wettability characteristics. Uniform and mixed wet bead packs with varying degree of wettability were fabricated to analyze how the residual saturation profiles and the distribution of fluid phases at the pore scale respond to changes in wettability. X ray microtomography was used to visualize and analyze the fluid distribution in each bead pack at the end of oil and brine injection. It was found that sweep efficiency was high for the uniform, strongly wetting glass bead pack. For the intermediate wet plastic bead pack, we observed evidence of viscous fingering resulting in degenerating sweep efficiency after water injection. In media with mixed wetting surfaces, the spatial distribution of wettability influenced the topology of the saturation profiles and resulted in larger quantities of disconnected fluid blobs. Results also showed that the average blob size was independent of the average residual saturation. In addition, the difference in saturation conditions preceding each injection affected sweep efficiency. The residual saturation after the 1st displacement was higher than the residual saturation after the 2nd displacement.\r\nThe provided data consists of the raw images and the segmented images of three different samples. The samples were identified by experiment conducted as follows:\r\n1. Experiment I was conducted using a plastic bead pack with a 78.69 mm length.\r\n2. Experiment II was conducted using a mixed wet bead pack consisting of plastic and glass beads. The bead volume fraction in this pack consisted of 42.9 percent plastic beads and 57.1 percent glass beads, with a length of 78.08 mm. We refer to this sample as the glass/plastic bead pack. \r\n3. Experiment III was conducted using two separate bead packs in one core holder. These bead packs were aligned in series, separated by a flow distributor with nylon screens. The bottom bead pack was 44.80 mm long and consisted of glass beads. This bead pack will be referred to as the glass bead pack. The top bead pack was 47.39 mm long and included two types of beads, glass beads and oil wet, coated glass beads. The bead volume fraction in this pack consisted of 50 percent glass beads and 50 percent coated glass beads. This sample will be referred to as the glass/coated glass bead pack.",
    "DRP-473.json": "Micro-CT scans of a fractured Eagle Ford shale core were used to assess the variability of aperture in the rough fracture. The rough fractured shale core was scanned using a Nikon XT H 225 microtomograph micro-CT scanner before using it to conduct the core flood experiments. The microtomograph has a 225 kV microfocus x-ray source with 3 μm focal spot size and an X-ray detector Varian Paxscan 1500 by 1900 pixels. \r\n\r\nExperiments were conducted to evaluate the dynamic stability of two foam formulations with qualities ranging from 70 to 95% at elevated temperatures and pressures while flowing through smooth and rough fractures. The results of the core flood experiments indicated that foam flowing through rough fracture surfaces with heterogeneous apertures exhibited continuous regeneration compared to smooth saw-cut surfaces. \r\n\r\nThese micro-CT scans of the shale fracture images confirmed the large variations in aperture along different regions of the core, indicating that rough fracture walls are effective in providing a tortuous path for foam flow.",
    "DRP-42.json": "SEM images of pores in unconsolidated muds of Pleistocene to Miocene age drilled at Site C0002 by the Integrated Ocean Drilling Program (IODP) Expeditions 315 and 338. \r\nSamples in this project were prepared by Ar-ion milling then Ir-coated, and imaged on an FEI NovaNano SEM 430.\r\nThis image set is used in the Nole et al. (2016) paper referenced in Publications tab. The table (.xlsx, .pdf format) attached to 2B 10R 3 origin data gives basic information on depth of all samples in this project.\r\n\r\nAdditional information on the drilling sites for Expeditions 315 and 338 can be obtained from the following links:\r\nhttp://publications.iodp.org/preliminary_report/315/\r\nhttp://publications.iodp.org/preliminary_report/338/\r\nhttp://publications.iodp.org/proceedings/314_315_316/314315316toc.htm\r\nhttp://publications.iodp.org/proceedings/338/338title.htm\r\nhttp://publications.iodp.org/proceedings/314_315_316/314315316bib.htm\r\nhttp://publications.iodp.org/proceedings/338/338bib.htm",
    "DRP-279.json": "X-ray computed tomography data supporting the work presented in the manuscript \"Rapid mineral precipitation during shear fracturing of carbonate-rich shales\" (Journal of Geophysical Research-Solid Earth, 2020) by Anne H. Menefee, Nathan J. Welch, Luke P. Frash, Wes Hicks, J. William Carey, and Brian R. Ellis. Descriptions are provided with each sample and xCT data set but please refer to the manuscript for more detailed information on samples and scanning parameters.\r\n\r\nCitation and DOI for this project: Menefee , A., Carey, B., Frash, L., Hicks, W., & Ellis, B. Rapid mineral precipitation during shear fracturing of carbonate-rich shale: Supporting xCT data. Digital Rocks Portal. https://doi.org/10.17612/S0FM-NP04",
    "DRP-500.json": "Experimental dataset of Sanquer et al. Environmental Science and Technology (2024), https://doi.org/10.1021/acs.est.3c09749, obtained using high resolution laser induced fluorescence imaging and optical index matching. A steady mixing front is created by a co-flow injection of two miscible fluids that react to produce a fluorescent compound in a bead pack.\r\n\r\nThe dataset includes:\r\n- 3D images of the bead pack\r\n- 3D images of a conservative tracer concentration field characterizing the mixing dynamics in the front\r\n- 3D images of a fluorescent component produced by the reactive mixing of the two fluids\r\n\r\nThe experiment was performed by creating a steady coflow injection of two fluids forming a mixing front in the direction transverse to the main flow direction. The first fluid contained a reactive solution non-fluorescent (potassium ferricyanide), while the second fluid contained a reactive fluorescent-precursor (fluorescin) and a conservative (i.e. non reactive) fluorescent dye (rhodamine). The reaction between the two reactants produced a fluorescent compound (fluorescein). We used the different emission spectrum of the two fluorescent solutes to images them jointly using different laser and filter wavelengths. Once the steady flow was obtained, we scanned the column from inlet (bottom) to outlet (top) for both wavelength in order to image both the conservative concentration field and the reaction product concentration field. Prior to the experiment, we also scanned the empty column (no tracers) to generate mask images.\r\n\r\nParameters of the column:\r\n- bead mean diameter : 7 mm\r\n- bead diameter range : 6-8 mm\r\n- measured porosity (using mask images) : 0.33\r\n\r\nParameters of the image stacks:\r\n- stack dimension (pixels) : 2000x2000x100\r\n- stack dimension (cm) : 3.1x3.1x22\r\n- 16 bits unsigned\r\n- concentration conversion (reaction product) : 30 500 = 1 µM of fluorescein\r\n- concentration conversion (conservative) : 35 000 = 1 µM of rhodamine\r\n\r\nThe data has been acquired at Géosciences Rennes, UMR6118 CNRS University of Rennes. \r\nData set authors: Hugo Sanquer, Joris Heyman, Khalil Hanna, Tanguy Le Borgne\r\nMain Related Publication : \"Microscale chaotic mixing as a driver for chemical reactions in porous media\", Environmental Science and Technology, https://doi.org/10.1021/acs.est.3c09749\r\nContact : tanguy.le-borgne@univ-rennes.fr",
    "DRP-384.json": "The characteristics of gas-water two-phase flow are the key to gas production and storage. We characterized gas-water two-phase flow in porous, fractured and vuggy carbonate rocks via gas and water flooding experiments with in-situ x-ray microtomography. The experiments were performed at room temperature, and detailed experimental procedures of gas flooding and water flooding are as follows:\r\n1. Initially, N2 gas was injected at 0.005 mL/min (the corresponding capillary number was calculated to be 1 × 10-9) until water production stopped, and the sample was CT imaged several times during flooding. The gas flow rate was then doubled, while CT images were acquired for this higher flow rate. \r\n2. Subsequently water was injected at 0.01 mL/min (the corresponding capillary number was calculated to be 1 × 10-7). The first CT scan was carried out when water breakthrough occurred at the outlet of the core holder. To displace more residual gas, we increased the pore pressure, and imaged the sample under various pore pressures (the maximum pore pressure is 5 MPa). The confining pressure was always 2 MPa higher than the pore pressure.\r\nNote that the sample-to-detector distance and source-to-sample distance were 23 mm and 35 mm, respectively. Image acquisition took approximately 4 hr (2,001 projections of the samples were acquired). The 2,001 radiographs were reconstructed to CT slices and further analyzed using Avizo software.",
    "DRP-255.json": "Sessile drop images as well as MicroCT data for six different sandstones. This data accompanies a journal paper in Transport in Porous Media.",
    "DRP-310.json": "Scanning electron microscopy (SEM) image mosaics of broad ion-beam milled drill cutting samples of overburden shales collected from an Eagle Ford formation production well. Samples were collected from 5 depths: 6840' (Wilcox), 7560' (Wilcox), 8940' (Wilcox), 10560' (Midway), 11070' (Navarro). This dataset only contains the images shown in URTeC publication, and does not include all images used for analysis.",
    "DRP-202.json": "The dataset contains time-resolved synchrotron X-ray micro-tomographic images (grey-scale and segmented) of a waterflood experiment in a mixed-wet Ketton limestone sample. The tomographic images were acquired at a voxel-resolution of 3 µm and scanning time of 7 s. The data were collected at the TOMCAT beamline of the Swiss Light Source of the Paul Scherrer Institute (PSI SLS), with the aim to investigate pore scale processes in crude oil - brine - rock systems. Understanding such pore-scale processes is important for applications such as oil- recovery and environmental remediation. Further details on experimental protocols can be found in Rücker (2018). These time-resolved tomographic images can be used for investigations on flow dynamics in mixed-wet systems as well as for validation of pore-scale displacement models such as direct simulations, pore-network and neural network models.",
    "DRP-214.json": "This project presents particle straining in two unique configurations of vuggy proxy media: series and parallel vugs. The porous medium is generated by sintering glass bead (1.0 mm) with salt inclusions and then dissolving the inclusion with water flooding. Smaller sized glass bead particles (25 and 100 um) are injected in the proxy media to establish straining. Medical CT images of before and after injection are presented for two different flow rates (40 and 60 ml/min) and three different flow concentration (0.5%, 1% and 2%). \r\n\r\nThe experiments are labeled according to the flow rate and total injection concentration. e.g 4005 has a flow rate of 40 ml/min and total injection concentration of 0.5%. Effluent is collected for each experiment. It is filtered, dried, and weighed and presented with the trapped volume determined from CT images.\r\n\r\nEach experiment set has:\r\n(1) Raw CT data gathered using a medical CT scanner at 250 micron resolution before and after injection;\r\n(2) Porosity change caused by injection determined from CT images;\r\n(3) Vug surface before and after injection; \r\n(4) Permeability vs time in the top and bottom zone. The top zone is the top half of the core and the bottom zone is the bottom; and\r\n(5) Effluent volume ratios.",
    "DRP-307.json": "This project contains high resolution SEM images of sandstone samples from the Vanguard gas field in the UK sector of the Southern North Sea. The reservoir rock in the Vanguard field is the Leman Sandstone Member of the early Permian, Rotliegendes Group and was deposited during dry or semi-dry aeolian, fluvial or lacustrine environments. The reservoir has been buried to a depth of 2800 m and has been subjected to significant diagenesis creating a complex pore space containing quartz cement, illite, chlorite and partially dissolved K-feldspar in addition to primary grains.",
    "DRP-215.json": "A Diverse Super Resolution Dataset of Digital Rocks (DeepRockSR): Sandstone, Carbonate, and Coal.\r\n\r\nThis dataset contains an organised and processed collection of greyscale digital rock images for the purpose of image super resolution training. In total, there are 12,000 2D images and 3,000 3D volumes contained in this dataset.\r\n\r\nSandstone:\r\n\r\n    Bentheimer Sandstone 1 https://www.digitalrocksportal.org/projects/211\r\n    Bentheimer Sandstone 2 https://www.digitalrocksportal.org/projects/135\r\n    Berea Sandstone https://www.digitalrocksportal.org/projects/135\r\n    Leopard Sandstone https://www.digitalrocksportal.org/projects/135\r\n    Gildehauser Sandstone https://www.digitalrocksportal.org/projects/134\r\n    Wilcox Tight Sandstone https://www.digitalrocksportal.org/projects/6\r\n\r\nCarbonate: \r\n\r\n    Estaillades Carbonate https://www.digitalrocksportal.org/projects/58\r\n    Savonnieres Carbonate https://www.digitalrocksportal.org/projects/72\r\n    Massangis Carbonate https://www.digitalrocksportal.org/projects/73\r\n\r\nCoal: \r\n\r\n    Sheared Coal https://www.digitalrocksportal.org/projects/21\r\n    Naturally  Fractured Coal https://www.digitalrocksportal.org/projects/20\r\n\r\n\r\nThe dataset is organised in a similar fashion to the DIV2K dataset : (https://data.vision.ee.ethz.ch/cvl/DIV2K/). To the knowledge of the authors, this dataset is the first of its kind to be used for the purpose of benchmarking Super Resolution algorithms in digital rock images. This dataset has been used thus far to test several Super Resolution Convolutional Neural Networks (SRCNN). Results are described in the Related Publications tab on this page.\r\n\r\nPlease cite both this dataset (use its DOI) as well as the related journal publication. \r\n\r\nData overview:\r\nThe dataset is divided into:\r\n    • 2D and 3D folders\r\n    • Sandstone, Carbonate, and Coal Datasets\r\n    • Combined shuffled Datasets\r\n    • High Resolution, 2x and 4x downsampled datasets using the Matlab imresize and imresize3 functions with default settings and randomised settings\r\n    • 2D HR images measure 500x500, cropped samples from the centre of the original cylindrical images, saved as PNG files\r\n    • 9600 2D images are available for training, 1200 for validation, and 1200 for testing.\r\n    • 3D HR volumes measure 100x100x100, cropped from the centre of the original cylindrical images, saved as octave and scipy readable MAT files (each array name is 'temp')\r\n    • 2400 3D volumes are available for training, 300 for validation, and 300 for testing.\r\n\r\nThe folder structure is as follows:\r\n    • DeepRockSR/ – the parent folder\r\n    • DeepRockSR/DeepRockSR-2D/ – folder for all 2D data\r\n    • DeepRockSR/DeepRockSR-2D/sandstone2D – folder for 2D sandstone Data\r\n    • DeepRockSR/DeepRockSR-2D/carbonate2D– folder for 2D carbonate Data\r\n    • DeepRockSR/DeepRockSR-2D/coal2D– folder for 2D coal Data\r\n    • DeepRockSR/DeepRockSR-2D/shuffled2D – folder for 2D shuffled Data\r\n\r\nand similarly for the 3D dataset, under the exact same structure.\r\n\r\nWithin each carbonate, sandstone, and shuffled folder, the structure is as follows, using the 2D shuffled folder as example:\r\n    • /shuffled2D_train_HR/ – 0001.png, 0002.png, ..., 0800.png train HR images\r\n    • /shuffled2D_train_LR_default_X2/ -- 0001x2.png, 0002x2.png, ..., 0800x2.png train LR images, downscale factor x2\r\n    • /shuffled2D_train_LR_default_X4/ -- 0001x4.png, 0002x4.png, ..., 0800x4.png train LR images, downscale factor x4\r\n    • /shuffled2D_train_LR_unknown_X2/ -- 0001x2.png, 0002x2.png, ..., 0800x2.png train LR images, downscale factor x2\r\n    • /shuffled2D_train_LR_unknown_X4/ -- 0001x4.png, 0002x4.png, ..., 0800x4.png train LR images, downscale factor x4\r\n    • Validation\r\n    • /shuffled2D_valid_HR/ -- 0801.png, 0802.png, ..., 0900.png validation HR images\r\n    • /shuffled2D_valid_LR_default_X2/ -- 0801x2.png, 0802x2.png, ..., 0900x2.png train LR images, downscale factor x2\r\n    • /shuffled2D_valid_LR_default_X4/ -- 0801x4.png, 0802x4.png, ..., 0900x4.png train LR images, downscale factor x4\r\n    • /shuffled2D_valid_LR_unknown_X2/ -- 0801x2.png, 0802x2.png, ..., 0900x2.png train LR images, downscale factor x2\r\n    • /shuffled2D_valid_LR_unknown_X4/ -- 0801x4.png, 0802x4.png, ..., 0900x4.png train LR images, downscale factor x4\r\n    • Testing\r\n    • /shuffled2D_test_HR/ -- 0901.png, 0902.png, ..., 1000.png test HR images \r\n    • shuffled2D_test_LR_default_X2/ -- 0901x2.png, 0902x2.png, ..., 1000x2.png train LR images, downscale factor x2\r\n    • shuffled2D_test_LR_default_X4/ -- 0901x4.png, 0902x4.png, ..., 1000x4.png train LR images, downscale factor x4\r\n    • shuffled2D_test_LR_unknown_X2/ -- 0901x2.png, 0902x2.png, ..., 1000x2.png train LR images, downscale factor x2\r\n    • shuffled2D_test_LR_unknown_X4/ -- 0901x4.png, 0902x4.png, ..., 1000x4.png train LR images, downscale factor x4",
    "DRP-350.json": "I took a stack of images of Belgian Fieldstone collected by Tom Bultreys at Ghent University and segmented them, generating masks of the fieldstone grains with quartz in (white), glauconite (yellow), and pore spaces (blue). The masks can be analyzed for surface area/volumetric information and allow for complete control over data visualization enabling each component of the column to be visualized independently.",
    "DRP-203.json": "Stalagmite ML-1 was scanned using neutron and x-ray computed tomography to assess the internal structure and liquid inclusion distribution. The x-ray computed tomography data illustrate the internal calcite density and crystal structure. The neutron computed tomography data show the distribution of light atoms, like hydrogen, in the stalagmite lattice.",
    "DRP-79.json": "The modeling data contained herein corresponds to the following publication:\r\n\r\nMehmani, Y., Tchelepi, H.A., \"Minimum Requirements for Predictive Pore-Network Modeling of Solute Transport in Micromodels\", Advances in Water Resources, (2017), http://dx.doi.org/10.1016/j.advwatres.2017.07.014\r\n\r\n\r\nThese include:\r\n===========\r\n1) STL files used in direct numerical simulations (DNS)\r\n2) Pore networks extracted using the developed method therein (data + images)\r\n3) Matlab script for plotting the pore networks\r\n4) Predicted breakthrough curves (DNS and PNM)\r\n\r\nDefinitions:\r\n========\r\nPNM = pore network modeling (in-house Matlab code)\r\nDNS = direct numerical simulation (OpenFOAM)\r\n\r\nNotes:\r\n=====\r\nAll simulation domains are planar 3D micromodels (or 2D with an out-of-plane thickness), in which solid grains are sandwiched between two parallel plates.The pore space is thus 3D, with the top and bottom plates contributing to flow resistance. However, for visualization and network extraction purposes, it suffices to work with 2D images, which can be protruded in the out-of-plane direction to obtain the 3D geometry. All plots uploaded to this project are therefore 2D plane views.",
    "DRP-151.json": "Three high resolution X-ray micro-tomography datasets of carbonate reservoir rock samples obtained after 20 pore volumes of waterflooding at subsurface conditions. The three samples (Sample 1, Sample 2 and Sample 3) have been aged to restore the reservoir wetting conditions (mixed-wettability). The mixed wetting conditions have been characterized by in situ effective contact angle measurements using the automated algorithm developed by AlRatrout et al., 2017 applied on the segmented images.\r\n\r\nMore details can be found in Alhammadi et al., 2017:\r\n\r\nAlhammadi A.M., AlRatrout, A., Singh, K., Bijeljic, B., Blunt, M.J. In situ characterization of mixed-wettability in a reservoir rock at subsurface conditions. Scientific Reports. 7 (1), 10753 (2017).",
    "DRP-55.json": "This is data for imaged drainage and imbibition experiments with three fluid phases (water, air, Soltrol oil) that comprise a spreading system. \r\nImage resolution is 9.2 microns.\r\n\r\nAll files in this project are segmented, binary files with the following information:\r\nfile dimensions: 695 695 410\r\nheader: 64 bytes\r\ndata type: 8-bit\r\nbit order: little-endian\r\nindex order: x fastest\r\ngray value id: 0=surrounding, 1=water,  2=soltrol oil,  3=air, 4=beads\r\n\r\nThe sample is a mixture of 3 different sized beads (35% 600 um, 35% 850 um, and 30% 1000–1400 um). Average grain size was 900 um. Porosity is 0.37.\r\n\r\nDensity in kg/m3 for  air, water and oil and was 1.2, 1000 and 790, respectively. Viscosity in cP for air, water and oil was 0.018, 1 and 4.82, respectively. The pairwise interfacial tensions in dynes/cm were: 71 for air/water,  37 for oil/water, and 25 for air/oil.",
    "DRP-297.json": "Micro-CT scan of a 4 mm diameter Belgian fieldstone (glauconite-rich sandstone) sample acquired with the HECTOR micro-CT scanner at Ghent University's Centre for X-ray Tomography (UGCT). 2400 projections were acquired with an exposure time of 1s each. The X-ray tube settings: 100 kV, 10W. The sample had a porosity of 18.16%. It consists out of quartz (low grey values) and glauconite (high grey values). Pore network model and lattice-Boltzmann simulations on this image were compared to minipermeameter and capillary absorption measurements by De Boever et al. 2016.",
    "DRP-278.json": "The data sets contains in situ imaged fluid distribitions for two-phase drainage at four fractional flows under steady state condition for a water-wet Bentheimer sandstone and an altered mixed-wet Bentheimer sandstone. These multiphase images are used for curvature measurement and relative permeability measurement for two wettability conditions while dry images are used for porosity  and absolute permeability measurements. Further details on experimental protocols can be found in Zou (2018,2019). Data was acquired  at the University of New South Wales, Tyree X-ray Imaging Facility.",
    "DRP-188.json": "We provide data from investigation on spontaneous imbibition for both SCAL-sized plugs and mini-plugs, spanning length scale from the sub-pore scale to Darcy scale. Data is discussed in https://doi.org/10.1029/2018WR024541 \"Imaging Spontaneous Imbibition in Full Darcy‐Scale Samples at Pore‐Scale Resolution by Fast X‐ray Tomography\" published in Water Resources Research.\r\n\r\nNote that in the paper, for dynamic images, the scan time 1 was for 11 minutes, followed by a a pause of 50 minutes, then scan time 2 was for 11 minutes, etc.   Thus the time elapsed (delta t) reported  in the paper should be 2 hours. For the other samples the time in the above paper was was reported correctly.",
    "DRP-472.json": "The surface topographies of natural rock fractures of 9 Aji granites (fine grain size) and 6 Inada granites (medium grain size) containing a single tensile fracture, obtained using a 3D microscope. The data set was used for synthetic fracture generation and further analysis for a series of Lattice Boltzmann fluid flow simulations and finite element analysis of electrical and elastic properties to relate hydraulic-electrical-elastic properties of fractures.\r\n\r\nFile opening: Any of the files in this project can be opened in MATLAB simply using 'load' command, but also also in open source Python environments using 'hdf5storage' package (please install it as necessary). Here is an example script for a file named 'hangwall.mat' and assuming you have downloaded this file into the same directory where you are running the script:\r\n\r\nfrom hdf5storage import loadmat\r\nimport matplotlib.pyplot as plt\r\n\r\n# 'H' is the dictionary key for \"hangwall.mat\"\r\n# For footwall*, the dictionary key appears to be 'F'\r\nimg = loadmat(r'hangwall.mat')['H']\r\n\r\nplt.figure()\r\nplt.imshow(img)",
    "DRP-167.json": "This dataset contains 3D images of a Ketton water-wet rock saturated with two or three phases (KI-doped brine, iododecane-doped decane and nitrogen). The images were obtained at two different resolutions (5 and 2 micrometres per voxel side) using a laboratory based X-ray micro-CT scanner.\r\n\r\nWe provide raw data after each of the following injection steps:\r\n- dry image\r\n- oil injection in a fully brine saturated sample (OI)\r\n- first waterflooding (WF1)\r\n- gas injection (GI)\r\n- second waterflooding (WF2)\r\n\r\nDue to the use of some dopants, the attenuation order of the phases to X-rays is the following, from least attenuating (darkest) to most attenuating (brightest) ones:\r\n1) gas\r\n2) brine\r\n3) rock\r\n4) oil\r\n\r\nPlease use doi:10.17612/P7HT11 within your citation for correct tracking.",
    "DRP-219.json": "Porous carbonado diamonds were imaged in 3D using X-ray computed tomography before and after every step in a sequential acid digestion procedure. The resulting scans were registered to one another and masked to eliminate all exterior voxels (e.g. air, bag, and container). These images were then used to understand the effects of different acids on the pore-filling minerals. We were also able to assess how the nature of pore-filling material can affect measurements of porosity.",
    "DRP-34.json": "This project contains the steady-state water saturation images for five CO2-brine primary drainage experiments conducted in Berea sandstone at 20 C and 10.3 MPa.",
    "DRP-425.json": "This dataset contains tomogram and segmentations of micro-CT acquired Bentheimer Sandstone samples.  All samples are segmented into: pore, clay region, quartz, feldspar, and high-density mineral, with the exception of BHG0 for which only the first three phases are segmented. The images are in netCDF format, which can be visualized by 'ncview'. This is free software licensed under the GNU General Public License version 3.\r\n\r\nIn associated publications phase-specific petrophysical quantities significant for the interpretation of NMR relaxation responses, e.g., transverse and longitudinal surface relaxivity, effective diffusion coefficient, and effective transverse and longitudinal relaxation time of clay regions are derived using Inverse Solution Workflows (ISWs) alleviating the computational burden using Bayesian optimization.",
    "DRP-5.json": "X-ray microtomography image of partially cemented fracture from Travis Peak Formation in Texas, well SFOT #1, sample taken from depth  of 10105ft.\r\nData set authors: Adenike Tokan-Lawal, Masa Prodanovic and Peter Eichhubl.",
    "DRP-126.json": "The project summarizes activity for quantitative pore-scale characterization of a tight gas reservoir using digital rock physics (DRP) approach in the result of tight collaboration with NOCs and IOCs.",
    "DRP-258.json": "This project provides 2D synchrotron micro X-ray fluorescence (µXRF) and micro X-ray diffraction (µXRD) data, as well as generated mineral maps for a shale rock from the Eagle Ford formation. The Eagle Ford shale is an organic-rich laminate shale in southern Texas that is actively drilled for unconventional oil and gas operations. The Eagle Ford shale sample in this study is a calcareous mudstone consisting of ultra-fine-grained calcite and silicate minerals arranged in a foliated texture with concentrated layers of larger calcite grains (Spokas et al. 2019). It was originally obtained from an outcrop, purchased from Kokurec Industries.\r\n\r\nThe synchrotron data were obtained at Advanced Photon Source (APS) of Argonne National Laboratory, beamline 13-ID-E (Lanzirotti et al. 2016, Sutton et al. 2017), a beamline that houses a hard X-ray microprobe with diffraction and fluorescence detection capabilities with raster scanning at micron resolutions. Raw synchrotron data can be interpreted and further analyzed using LARCH (Newville 2013).\r\n \r\nThis project includes coupled µXRF-µXRD data from a 2D scan of a thin section of an Eagle Ford shale rock (‘EFS1’) of size 500 µm by 500 µm (resolution: 2 µm). For 8 selected elements, fluorescence intensity map images are included as part of the analysis data.\r\n\r\nAlso included is 2D µXRF data from a 7 mm by 2 mm area (resolution: 4 µm) of the same Eagle Ford shale rock (‘EFS2’). Similarly, element intensity map images for 8 selected elements are provided. \r\n\r\nMineral maps of the shale were generated using SMART mineral mapping method, an original method developed by the authors (Kim et al. 2020 in prep – see publications tab). The SMART mineral mapper utilizes an Artificial Neural Network trained on coupled XRF-XRD data. The resulting mineral classifier can reliably map minerals for an input of new µXRF data. A subset of the coupled data for EFS1 served as training data, and the µXRF data for EFS2 were interpreted using the SMART mineral mapper. \r\n\r\nScripts to generate mineral distribution maps written in MATLAB® (V. 9.3, The Mathworks Inc.), and all data needed for mineral map generation are included as a part of analysis and origin data, respectively.",
    "DRP-223.json": "Dataset: Bentheimer networks\r\nBentheimer is imaged by a ZEISS Versa X-ray Microscope (XRM) (ZEISS X-Ray Microscopy, Pleasanton, CA). A series of 1600 2D projections are acquired at regular angular increments over a 360° rotation. These reconstruct a series of 3D volumes: cylinders which are then cropped to the maximally inscribed cubes. 2D projections are 1024 x 1024 pixels, and 3D volumes are 1024 x 1024 x1024 voxels. Images are segmented by ZEISS Zen Intellesis machine learning (Andrew, 2018). \r\nThe Bentheimer network is deformed to using elastic simulation techniques, creating a series of compressed networks. The Bentheimer network is deformed using the algorithm of Rutka and Wiegmann (2006), simulating deformation to target strains of 2%, 4%, 6%, 8%, 10%, 20%, 30%, 40%, and 50%.",
    "DRP-331.json": "High-resolution X-ray imaging combined with a steady-state oil-brine flow experiment is used to demonstrate how pore-scale displacement affects macroscopic properties – relative permeability and capillary pressure – in an altered-wettability microporous carbonate.",
    "DRP-274.json": "This project include X-ray micro-CT images of methane hydrate formation in sandy sediments in two experiments:\r\n(1) NaBr experiment at 0 day (out of hydrate stability zone) and after 19 days of hydrate formation. Hydrate formation was induced by cooling at high pressure. Brine: 1.5 wt% NaBr brine. resolution: 12.50 um.\r\n(2) KI experiment #1 at 0 day (out of hydrate stability zone) and after 13 days of hydrate formation. Hydrate formation was induced by cooling at high pressure. Brine: 4.4 wt% KI brine. resolution: 11.40 um.\r\n\r\nThis data corresponds to the journal paper in Xiongyu Chen, D Nicolas Espinoza, Jeffrey S. Luo, Nicola Tisato and Peter B Flemings, (2020), Pore-scale evidence of ion exclusion during methane hydrate growth and evolution of hydrate pore-habit in sandy sediments, Marine and Petroleum Geology (see Related publications).\r\n\r\nData DOI: 10.17612/CP8P-7917",
    "DRP-370.json": "Micro-CT images of two deformed calcareous shale samples belonging to the Arro-Fiscal Formation from the Jaca basin (Spain). Images used to study the grain shape fabric of quartz grains. The dataset includes raw and segmented images of the volume of interest of each sample (A4-1 and A4-2) as well as the excel sheets for grain analysis.",
    "DRP-394.json": "Digitized natural rock fracture of andesite containing a single tensile fracture retrieved from geothermal area, Japan. The fracture surfaces were obtained with laser profilometer. This dataset contains the csv files for footwall and hanging wall of surface topographies of  sample. The dataset was used for a series of Lattice Boltzmann fluid-flow simulations and Finite Element analysis of electrical and elastic properties for relating hydraulic-electrical-elastic properties of fractures.",
    "DRP-117.json": "This project includes high resolution images of three hydrate growth experiments.\r\n\r\nData are from an accepted paper by Xiongyu Chen and D. Nicolas Espinoza published in Fuel in 2018, titled \"Ostwald Ripening Changes the Pore Habit and Spatial Variability of Clathrate Hydrate\"\r\n\r\nExp1: Xenon hydrate growth inside an aluminum vessel half filled with pure water and half filled with xenon gas. T= 23 C, P_initial = 2.84 MPa. The image stack is taken with X-ray uCT after 1 days of hydrate growth. Resolution =48.39 um.\r\n\r\nExp2: Methane hydrate growth on pure water droplets (droplets on a PTFE plate) during 14 days period. Images are taken with HD camera. T= 1 C, P_initial=7.05 MPa. Resolution =3.58 um.\r\n\r\nExp3: Xenon hydrate growth inside an aluminum vessel that packs sand between a spring, a top spacer and a bottom spacer. There are metal screens between the spacers and the sand to stop sand. T=23C, P_initial =3.72 MPa. Aqueous phase is 10wt% NaBr brine. The image stack is taken with X-ray uCT after 4 days of hydrate growth. Resolution =48.92 um.",
    "DRP-44.json": "The dataset contains a series of SXCMT images of a sandy quartz media column during silver nanoparticle injection and elution from this media. The column was imaged 8 times during the silver nanoparticle transport experiment, and 4 images were captured at each time-step (at 4 different energies). Each set of 4 images were compiled to create 1 dataset of pore-scale silver nanoparticle concentration distribution for each time-step. \r\n\r\nThis dataset contains the following images:\r\nPre injection (0 PV) dataset - 4 Gray scale images (25.414, 25.614, 25.714, 25.814 keV) and 1 nanoparticle concentration dataset\r\n0.25 PV dataset - 4 Gray scale images (25.414, 25.614, 25.714, 25.814 keV) and 1 nanoparticle concentration dataset\r\n0.5 dataset - 4 Gray scale images (25.414, 25.614, 25.714, 25.814 keV) and 1 nanoparticle concentration dataset\r\n0.75 PV dataset - 4 Gray scale images (25.414, 25.614, 25.714, 25.814 keV) and 1 nanoparticle concentration dataset\r\n1 PV dataset - 4 Gray scale images (25.414, 25.614, 25.714, 25.814 keV) and 1 nanoparticle concentration dataset\r\n2 PV dataset - 4 Gray scale images (25.414, 25.614, 25.714, 25.814 keV) and 1 nanoparticle concentration dataset\r\n4 PV dataset - 4 Gray scale images (25.414, 25.614, 25.714, 25.814 keV) and 1 nanoparticle concentration dataset\r\n5 PV dataset - 4 Gray scale images (25.414, 25.614, 25.714, 25.814 keV) and 1 nanoparticle concentration dataset\r\n\r\nThis dataset has been used in the following studies:\r\n - Molnar, I.L.; Gerhard, J.I.; Willson, C.S. and O’Carroll, D.M., (2015), The impact of immobile zones on the transport and retention of nanoparticles in porous media. Water Resources Research. 51, (11), 8973–8994\r\n - Molnar, I. L.; Sanematsu, P; Gerhard, J.I.; Willson, C.S. and O'Carroll D.M., Quantified pore-scale nanoparticle transport in porous media and the implications for colloid filtration theory, (Submitted)\r\n\r\nThe analysis datasets were calculated and calibrated using the method described in the following paper:\r\n - Molnar, I.L.; Willson, C.S.; O’Carroll, D.M.; Rivers, M.L. and Gerhard, J.I., (2014), Method for Obtaining Silver Nanoparticle Concentrations within a Porous Medium via Synchrotron X-ray Computed Microtomography. Environmental Science and Technology, 48, (2), 1114-1122.",
    "DRP-140.json": "Flow and transport within porous- and microtextured-walled channels is relevant to a number of natural and industrial processes. Designing and optimizing the topology of the pores and/or microstructure to achieve target performance at the system-scale (or macroscale) is still an open question. Fully-resolved three-dimensional pore-scale simulations  are the most accurate representation of the actual experiment or system, but their computational burden may be prohibitively high. A continuum treatment of the micropattern   can significantly reduce the computational cost of the numerical solver. Yet, the underlying approximations of macroscale models developed in the context of porous-walled channels (or channel-matrix systems) have rarely been experimentally tested, quantified  nor validated.  In this work, we study whether hydrodynamic dispersion in microfluidic channels with walls structured by obstacles can be modelled by dispersion in channels with porous walls described as continuous porous media of zero or  finite permeability.  We perform microfluidic experiments in channels embedded in micropatterns with different topologies. Specifically, we focus on transverse riblets and arrays of pillars as examples of impermeable and permeable obstructions, respectively.  We  compare the experimental results with three models: 3D pore-scale  simulations which resolve the micropattern geometry explicitly and two upscaled models which treat the micropattern as a continuum of zero or finite permeability. This study demonstrates that  polydimethylsiloxane (PDMS) micromodels with appropriately  patterned surfaces can be successfully employed to validate various continuum-scale modelling approximations  in different physical regimes, identified by the order of magnitude of Peclet number and the obstruction permeability.",
    "DRP-290.json": "We upload x-ray microtomography image of a Doddington sandstone sample with 5.3858 micron voxel-length. Doddington sandstone is a  high porosity, high permeability quartz arenite. See Related Publications on more information about the dataset.",
    "DRP-443.json": "Fluid flow in complex fracture systems near wellbore is influenced by heterogeneous fluid pathway structure, proppant distribution and stress-induced fracture aperture change. The current physical experiments and pore scale simulations only study the multiphase flow properties of hydraulic fracture (HF) with no proppant while the multiphase flow properties of induced fracture network (IFN) and HF with proppant are not available. \r\nThis data contains the binary images of IFN, HF and HF with proppant. The 3D binary images are obtained from original 3D grayscale CT images after median filtering and thresholding. The imaged fracture samples are collected from a shale oil reservoir in China. The fracture samples in this project can be USED to study the fluid flow properties and mechanical properties in complex fracture systems; please see the related publication.",
    "DRP-228.json": "MicroCT images of residual CO2 trapping in oil wet sandstone.",
    "DRP-253.json": "Synchrotron data of first waterflooding (WF1), gas injection (GI) and second waterflooding (WF2) in a mixed-wet Ketton limestone sample after primary oil drainage.\r\n\r\nPhase 1 = oil\r\nPhase 2 = water\r\nPhase 3 = rock\r\nPhase 4 = gas\r\n\r\nThe Ketton sample was scanned every 70 seconds while water was injected from the bottom, with voxel size of 3.5 μm",
    "DRP-195.json": "High-resolution X-ray CT scans and processing of fracture in granite for modeling 3D fracture flow.  Primary fracture mapped using IPSF method.",
    "DRP-204.json": "Bidisperse sphere packs consisting of small (clay) and large (silt) grains were generated under the effect of gravity to model mudrocks and study the petrophysical properties. Multiple, periodic, dense, bidisperse sphere packs were created with large grain volume concentrations (VL) increasing from 0 to 100 %. This was done for large to small grain radius ratios of 2:1, 5:1, 7:1, and 10:1 with constant sphere pack length 10 units in x, y, z directions. The data for each sphere pack consists of the x, y, z coordinates of the sphere centers and the sphere radii stored in .csv files. Cross-sectional images visualized in ParaView are shown for clarity.",
    "DRP-29.json": "Data sets for Bentheimer and Buff Berea sandstones, used for testing velocity field simulator. Tomographic images and segmented data are available, with a selection of corresponding pressure and velocity fields. See Publications tab for details on segmentation method and velocity simulation algorithm. These samples were imaged and made available by Petrobras, who are gratefully acknowledged.",
    "DRP-232.json": "2D bead-packs (0.6 m x 0.6 m x 0.02 m) were generated with realistic geological features (cross-stratification and ripple lamination). To demonstrate an application of the technique, gravity unstable multiphase flow experiments were conducted in the generated bead-packs. This project contains time-lapse videos of these flow experiments.",
    "DRP-265.json": "X-ray micro-CT images of waterflooding in Berea sandstone. The datasets consists of two images:\r\n- segmented water-wet sample (Berea_Unaltered_waterflooding_segmented)\r\n- segmented mixed-wet sample (Berea_Altered_waterflooding_segmented)\r\n\r\nThe images were segmented into six phases: clay minerals; quartz-feldspar minerals; cemented calcite; others highly X-ray attenuating minerals; brine phase; oil phase. \r\n\r\nThese images have been employed to investigate the role of mineralogy in controlling rock wetting state in oil-brine systems. For additional information, please refer to Garfi et al. (2019):\r\nGarfi Gaetano, Qingyang Lin, Steffen Berg, Cédric M. John, and Sam Krevor. 2019. “Fluid Surface Coverage Showing the Controls of Rock Mineralogy on the Wetting State.” EarthArXiv. December 13. doi:10.31223/osf.io/e4tp2.",
    "DRP-273.json": "Digitalized natural rock fractures of two Inada granites containing a single tensile fracture, obtained with 3D microscope. This dataset contains the surface topographies of each sample, simulated aperture distributions, corresponding 3D reconstruction and the results of Lattice Boltzmann fluid-flow simulations. The dataset was used for a series of Lattice Boltzmann fluid-flow simulations and Finite Element analysis of electrical and elastic properties for relating hydraulic-electrical-elastic properties of fractures.",
    "DRP-361.json": "We applied three-dimensional X-ray microtomography to image a capillary drainage process (0-1000 kPa) in a cm-scale heterogeneous laminated sandstone containing three distinct regions with different pore sizes to study the capillary pressure. We used differential imaging to distinguish solid, macro pore and five levels of sub-resolution pore phases associated with each region. The brine saturation distribution was computed based on average CT values. The non-wetting phase displaced the wetting phase in order of pore size and connectivity. The drainage capillary pressure in the highly heterogeneous rock was dependent on the capillary pressures in the individual regions as well as distance to the boundary between regions. The complex capillary pressure distribution has important implications for accurate water saturation estimation, gas and/or oil migration and the capillary rise of water in heterogeneous aquifers.",
    "DRP-176.json": "This project was to develop and test a method to measure the size and shape of particles that are small relative to the scan resolution, in a way that is accurate, reproducible, objective, and resolution-invariant.  The scans are of an artificial core containing 12 gold grains embedded in quartz powder and epoxy (some iron filings are also mixed in), with sizes ranging from 100-300 microns (sphere-equivalent diameter), and a range of shapes.  There are 12 different scans on two instruments, with varying resolution, X-ray energy, and amount and type of additional embedding material (quartz, garnet) to simulate scanning small grains within progressively larger cores.  Scan resolutions range from 10-50 microns.",
    "DRP-72.json": "Savonnières limestone is a mono-mineralic, calcitic, layered oolithic limestone belonging to the Oolithe Vacuolaire (France). Its pore structure contains 4 types of porosity: inter-granular and intra-oolithic microporosity, and inter- granular and micro-connected macroporosity (hollow ooliths). The hollow ooliths are only connected to the other macro-pores by microporosity in the oolith-shells. Depending on local variations, the permeability ranges from 115 mD to more than 2000 mD (based on TinyPerm mini-permeameter measurements), and porosity ranges from 22% to 41%.",
    "DRP-434.json": "Digital rock physics performs the microstructure analysis and properties estimation through 3D volume visualization and numerical simulation. While the digital approach benefits from the fexible manipulation and various simulation scenarios, it experienced some drawbacks, for instance, the non-unique assumptions and simulation methods that even a small change can result in vital different results. 3D printing technique provides a physics-based experiment method that can complement and validate the digital rocks simulation. This study aims to perform the heterogeneity analysis on 3D volume of core plug by integrating digital rock physics and 3D printing tangible porous models. The publicly available digital rock dataset portal is acknowledged in this study and the CT images of Doddington sandstone uploaded by Matthew Andrew is utilized. \r\n\r\nThe sandstone CT images were first set scale in the voxel size of 5.3858 micron and cropped in a cylinder to ensure the correct range. Brightness and Contrast was adjusted and the commonly used Otsu threshold method was applied to segment the particles and pores that ends up with a binary image dataset. Then we programmed an ImageJ macro programmed to crop cubes with 200 voxels from the sample. 12 cubic models were obtained by performing the macro on binary CT image dataset and each can be opened in ImageJ 3D viewer displayed as a surface which were eventually exported as the STL binary files. A carbonate rock dataset was also processed following the same procedures for the comparison.\r\n\r\nFurther details on producing and cleaning up STL files for printing are as follows. The subvolumes of CT images were first cut in ImageJ and opened in ImageJ 3D viewer, where a surface can be generated and output. Then the files were opened in Meshmixer, a 3D Printing Processing Software, to clean up. In the function Edit-Separate Shells, the whole cubic volume and hundreds of isolated particles (\"debris\") can be separated. The isolated debris are the particles that are not connected to the matrix of the volume and therefore should be removed, otherwise they cannot be printed correctly due to lack of support. Next, in the function Edit-Transform, the model size is around 1080 mm of one side and I scaled down to 0.1X (108 mm side length) to be realistic when printing. The final file was output as STL binary format.",
    "DRP-137.json": "We propose a simple and efficient algorithm of downscaling followed by segmentation to reconstruct the unresolved pore space from X-ray computed tomography (XCT) images of natural geological porous media\r\ncolumns. Contrary to widely employed single and multilevel threshold-based segmentation, the proposed method is based on a continuous map between pixel intensity and local pixel porosity that does not rely on the definition of arbitrary thresholds. The approach is used to generate a high-resolution binary image of the porous medium from poorly resolved grey-scale images while preserving available sub-resolution information.",
    "DRP-160.json": "This project presents particle straining in vuggy proxy media, where the media is a sintered glass bead (1.0 mm) core with dissolvable inclusion. Smaller sized glass bead particles (25 and 100 um) are injected in the proxy media to establish straining. Medical CT images of before and after injection are presented for 2 different flow rates (40 and 60 ml/min) and 3 different flow concentration (0.5%, 1% and 2%). \r\n\r\nThe experiments are labeled according to the flow rate and total injection concentration. e.g 4005 has a flow rate of 40 ml/min and total injection concentration of 0.5%.\r\n\r\nEach experiment set has:\r\n- Raw CT data gathered using a medical CT scanner at 250 micron resolution before and after injection\r\n- Porosity change caused by injection determined from CT images\r\n- Vug surface before and after injection\r\n- Permeability vs time in the top and bottom zone. The top zone is the top half of the core and the bottom zone is the bottom.\r\n- Effluent is collected for each experiment. It is filtered, dried, and weighed and presented with the trapped volume determined from CT images.",
    "DRP-64.json": "The microstructure of meteorite NWA 2993 which is a coarse-grained Lodran-like achondrite. This meteorite is a plutonic sample from the Winonaite parent body that has undergone partial melting and is comprised of orthopyroxene (37 vol.%), olivine (32 vol.%) and metal (31 vol.%).",
    "DRP-65.json": "This dataset contains final texturally equilibrated pore structures using level set method. For more info see:\r\n1. Ghanbarzadeh, Soheil, Marc A. Hesse, and Maša Prodanović. \"A level set method for materials with texturally equilibrated pores.\" Journal of Computational Physics 297 (2015): 480-494.\r\n2. Ghanbarzadeh, Soheil, Maša Prodanović, and Marc A. Hesse. \"Percolation and grain boundary wetting in anisotropic texturally equilibrated pore networks.\" Physical review letters 113.4 (2014): 048001.",
    "DRP-161.json": "This project is part of a Guelph dolomite (GD) petrophysical characterization study. Multi-scale CT scans are conducted of a GD core (30 mm x 75 mm). Data processing supported by NSF CAREER grant (Prodanovic).",
    "DRP-73.json": "The Massangis Jaune variety of the Massangis limestone (France) is an ooid-dominated grainstone containing detrital micrite and bioclasts. Within the bulk of this rock, patches of several cubic centimeters with a different microstructure and a lower porosity occur seemingly randomly (Boone et al., 2014). The bulk, from which the sample used in this work was selected, has a porosity of 11.6% (measured by mercury intrusion porosimetry (MIP) to avoid averaging the porosity of the bulk and the patches) (Boone et al., 2014). It contains interparticular moldic macropores due to dedolomitization. The macropore network may or may not percolate, depending on the local amount of (de)dolomitization. Depending on this, permeability can range from 70 mD (measured by portable permeameter) to values on the order of 0.03 mD. Microporosity can be found in the partially dissolved dolomite lining the molds and in local ooids.",
    "DRP-198.json": "Synthetic fractures were created to quantify the effect of heterogeneity in surface roughness and mineralogy (which affects wettability) for multiphase flow.\r\n\r\nThis project includes:\r\n\r\n1) Rough fractures\r\n\r\n2) Slits exhibiting surfaces of different mineralogy/wettability (surfaces are circles and bands)\r\n\r\n3) A heterogeneously wet fracture\r\n\r\nThe MATLAB codes to create the geometries can be found at: https://github.com/je-santos/syntheticFractures",
    "DRP-462.json": "We use high-resolution three-dimensional X-ray imaging to identify the arrangement of fibers, water, and air in the gas diffusion layers containing different percentages of polytetrafluoroethylene (PTFE) coating: 5, 20, 40, and 60%. We quantify the contact angle and meniscus curvature once the water has spanned the layer, flow has ceased, and water has reached a position of equilibrium. We also combined with a pore network model to investigate the breakthrough capillary pressure and water saturation in gas diffusion layers. We also train deep learning models on base-case data prepared by the 3D Weka segmentation method and test them on the unfiltered unseen datasets.",
    "DRP-49.json": "Microtomography image of a fracture from Niobrara formation, CO, USA (tight carbonate).",
    "DRP-264.json": "This dataset contains time-resolved laboratory-based micro-CT images of saturated solute injection experiments in Savonnières limestone. The data were acquired with a gantry-based micro-CT system specially designed for in-situ imaging (UGCT). The experiments were imaged at 12 s per scan with a voxel size of 14.6 µm (Bultreys et al., 2016). Each fast imaging experiment was preceded by a higher quality slower pre-scan to determine the static pore structure. Pore-scale concentration fields can be quantified, based on the grey values in the resolved pore space. With these concentration fields, solute spreading and mixing during tracer injection experiments can be investigated. Further details on the analyses of such micro-CT images can be found in Van Offenwert et al. (2019). In addition to the dataset 'Saturated solute transport micro-CT dataset in sintered glass and Bentheimer sandstone' (10.17612/5ww0-gh34), this dataset contains data on solute transport in more heterogeneous porous media. It can be used to investigate the influence of pore-scale heterogeneity and the volumetric pump velocity (the Péclet number) on transport processes.",
    "DRP-233.json": "This is the raw image data for the paper 'Stress Sensitivity of Fractured and Vuggy Carbonate' in volumetric tif format. All of the images are from micro CT scanning and the resolution of the images is about 4.3 microns. The samples are typical carbonate samples taken from the right bank field of Amu Darya, Turkmenistan, which is a high-pressure marine carbonate gas reservoir and rich in fractures and vugs.\r\nWe carried out a series of experiments to learn about stress sensitivity of fractured and vuggy carbonates. We load and unload the stress on each sample to study the structure change of fractured and vuggy carbonate. In these datasets, \"up\" in the image title up means load the stress, and \"down\" means unload the stress.",
    "DRP-244.json": "Offshore Miocene sandstone (from Folk McBride Collection, Jackson School of Geosciences, The University of Texas at Austin). \r\nhttp://www.jsg.utexas.edu/alumni/support/folk-mcbride-thin-sections/\r\n\r\nExample thin section from an offshore Texas miocene sandstone. Quart-rich medium sand. Well number SMI 236 A4.\r\n\r\nImaging was done by Innova Plex, Inc. Please contact blee@innovaplex.com to obtain a license for their viewer/petrography software (VPViewer).\r\n \r\nThe resolution for all samples and all magnifications is 0.24 micrometer per pixel.\r\n\r\nThe file naming follows the template  OffshoreMiocene_20.jpx_0.05x_1817_3486_ppl.jpg \r\nwith:\r\nOffshoreMiocene_20 = Base name of the file\r\n0.05x = magnification\r\n1817, 3486 = location in the original image\r\nppl = plain polarized light",
    "DRP-86.json": "The details of the coal sample can be found in the following reference. \r\n\r\nRamandi, H. L., Mostaghimi, P., Armstrong, R. T., Saadatfar, M. and Pinczewski, W. Val, Porosity and permeability characterization of coal: a micro-computed tomography study, International Journal of Coal Geology, 154, pp. 57-68, 2016. \r\n\r\nTwo data sets are provided:\r\n1- Dry image of the coal sample (NetCDF format - 1505x1497x80, 16 bit)\r\n2 - Saturated with contrast agent (NetCDF format - 1505x1497x80, 16 bit)\r\nBoth images are registered to each other. \r\n\r\nWe have also provided a RAW format for each data set. The NetCDF format can be opened using the NetCDF plugin for ImageJ. \r\nProvided here: http://lmb.informatik.uni-freiburg.de/resources/opensource/imagej_plugins/netcdf.html",
    "DRP-69.json": "Statistical concepts were applied to reconstruct a 3D medium using 2D thin section images.",
    "DRP-213.json": "Conventional experiments using real rock samples have trouble in observing rock structures and controlling fracture properties. Taking advantage of 3D printing technologies, we made a complex fracture network by using a 3D printer. Hydraulic properties, such as porosity and permeability were similar with the theoretical values. A tracer response curve from the flow experiment were compared with numerical\r\nsimulations.",
    "DRP-205.json": "Mancos shale samples scanned pre and post-triaxial testing. Triaxial testing at various stress loading paths and confining pressures ranging from 100 to 500 psi. \r\n\r\nVideos of fracture network visualization using Fiji/Image-J post-triaxial testing can be found here:\r\nhttps://www.youtube.com/playlist?list=PLv0npDbE5HXvEdptgajRDG3x-lwmtGDbr\r\n\r\nX-ray power ranging from 16.9 to 30.3 W. Copper filters used with thicknesses varying from 0 to 0.25 mm. Exact voltage and current settings for each scan are listed separately. Scanned at 4 fps (frame per second) with an exposure time of 250 ms to give 2984 projections over 360°. Image type is 16-bit. Image properties for each scan are listed separately. Resolution (both voxel size and spot size) ranging from 65 to 75 µm\r\n\r\nDevice: Nikon XTH-225\r\nGraduate Research Assistants: Matthew Ramos and Jeffery Luo\r\nPrincipal Investigator: Dr. Nicolas Espinoza (https://sites.utexas.edu/eagle/)\r\nFacility Location: The University of Texas at Austin",
    "DRP-252.json": "We ackquired micro-CT images from two carbonate outcrops (Indiana Limestone and Silurian Dolomite), and used it to calculate porosity at each voxel (the samples are considered pure, since Indiana Limestone is 99% calcite, and Silurian Dolomite, 97% dolomite). For thus, we segmented pores (porosity=100%) and 'solid' (porosity=5%) and used the grayscale of these two points to calculate porosity directly in the image.\r\n\r\nSince there is no voxel with 100% solid at the resolutions used, we followed Arns et al. (doi:10.1051/e3sconf/20198905002) and adopted the concept of background porosity - we considered that 'solid' phase in fact corresponds to 5% porosity (this value was calculated using the same methodology as Qingyang Lin et al., doi:10.1016/j.advwatres.2016.08.002).\r\n\r\nBesides the porosity fields, we also obtained permeability fields for these samples by two methodologies:\r\n\r\nIn methodology \"P\", the porosity file was used as input in Winland equation to calculate the permeability field;\r\nIn methodology \"S\", we segmented the resampled micro-CT images in regions of similar permeabilities, considering that regions of similar grayscale values have similar permeabilities.",
    "DRP-317.json": "A set of 11 sandstone plugs from Kocurek Industries: Bandera Gray, Parker, Kirby, Bandera Brown, Berea Sister Gray, Berea Upper Gray, Berea, Castlegate, Buff Berea, Leopard and Bentheimer. Source: https://kocurekindustries.com/sandstone-cores.\r\n\r\nAll samples were subject to a combined experimental and computational analysis in order to estimate Porosity and Permeability. \r\n\r\nFor more details, please refer to: https://arxiv.org/abs/2010.10679.",
    "DRP-415.json": "Images associated to paper of the same name by B. Vega, A.R. Kovscek\r\n\r\nThis research was funded by the Center for Mechanistic Control of Unconventional Formations (CMC-UF), an Energy Frontier Research Center funded by the U.S. Department of Energy, Office of Science under DOE (BES) Award DE-SC0019165.",
    "DRP-229.json": "This dataset contains raw and segmented X-Ray micro-tomography images from steady-state drainage and imbibition flow experiments in two distinct Bentheimer sandstones. The dataset is presented and utilised in the paper 'Representative elementary volumes, hysteresis and heterogeneity in multiphase flow from the pore to continuum scale' available at: https://eartharxiv.org/2aejr/. Full details of the experimental setup, procedure and imaging analysis can be found in the paper and supporting information. \r\n\r\nThe experiments consist of steady-state co-injection core floods with micro-CT imaging and simulatenous pressure measurments, performed on two Bentheimer sandstone cores. These cores have a diameter of 12.35mm (cored with a 12.7mm,1/2\"drill bit), and length 73.2mm and 64.7mm, with core-averged porosities of 0.203 and 0.223 respectively. The shallow-marine Bentheimer sandstone typically consists of around 95% quartz with minor feldspar and clay and has a well-sorted grain size distribution. The first core is relatively homogeneous, whilst the second has oblique, low porosity layers orientated approximately 60 degrees to the flow direction. Brine (3.5wt.%KI) and decane (99.9%pure, Sigma-Aldrich) are used as wetting and non-wetting phases respectively, with an interfacial tension of appromxiately 51.16 mN/m (for the pure DI water - decanesystem). The outcrop Bentheimer is strongly water-wetting. \r\n\r\nThe experiments are performed with a confining pressure of 4.5MPa, and pore-pressure of 1.5MPa. Scans are performed with a Zeiss Versa 510 X-Ray microscope with a flat panel detector and various microscope objectives. Firstly, a full-core dry scan is obtained, at a resolution of 6 microns. The core is then saturated with high salinity brine (30wt.%KI), and a full core scan obtained for differential imaging purposes. The working fluid brine (3.5wt.%KI) is then pumped through the core, fully displacing the high-salinity brine, and the absolute permeability is measured. Following this, decane and brine are co-injected into the core at constant total flow rate (0.1 ml/min) varying the fractional flow in a drainage and imbibition process. At each fractional flow, once the differential pressure has stabilised a full-core scan is taken followed by zoom-in, region of interest scans.\r\n\r\nFor the 'full core' scans, 11 and 10 individual scans are taken at increasing vertical locations in each core, to cover a total volume after processing of 1950 x 1950 x 10800 voxels (11.7mm x 11.7mm x 64.8mm) and 1900 x 1900 x 9550 voxels (11.4mm x 11.4mm x 57.3mm) in core 1 and 2 respectively. Approximately 5mm is lost from the images near the inlet and outlet of the core due to noise from the end-pieces and the cone angle of the X-Ray beam. There is significant overlap between each scan to allow registration and merging of the full image. Each individual scan image is normalised to pre-selected references to obtain consistent grey-scale values throughout the core, registered with the first scan, and then merged to create a single image of the core. These are the 'raw' scans available in this data set.  After each full-core scan, a selection of zoom-in, region of interest scans are performed to facilitate the interfacial curvature measurements in the paper.  A 4x microscope objective lens is used to aquire each image, with the detector position varied to achieve a 3.5 micron resolution and 2 micron resolution image, each containing 1000 cubed voxels. These are the raw, ROI scans available in the dataset. \r\n\r\nThe segmented images are also available in the data set for the full core and region of interest scans. The segmented images show the connected and disconnected oil for the full core scans (binary images with 1 being the oil), and grain, water and total oil for the region of the interest images. Alongside this, the segmented porosity map is also available, which was generated through segmentation of the differential image (high salinity and dry raw images). Details of the differential segmentation and watershed segmented used for the fluid phases can be found in the paper.\r\n\r\nThe full core images herein have been divided into 50 equal subvolumes to faciliate downloading and utilising the dataset with small CPU and RAM requirements. The full, merged images can be found on the UKCCSRC data repository.\r\n\r\nAll resolution data is contained within the file name: full_core means 6um, 3_45 means 3.45 microns, 3_5 means 3.5 microns and 2_00 means 2 microns. Absolute voxel sizes in the images may differ but can be changed in settings to match the given scan resolutions mentioned previously. Also contained in the file names are the oil fractional flow and flood process. DraFo05 refers to a drainage step with a fractional flow of oil of 0.05. ImbFo5 refers to a imbibition step with a fractional flow of oil of 0.5.",
    "DRP-507.json": "This dataset contains synchrotron X-ray computed tomography (XCT) images of mixed-metal carbonate samples, which were coprecipitated with calcium (Ca), cadmium (Cd) and zinc (Zn). The samples were scanned at multiple photon energies at the transmission X-ray microscope (TXM) beamline 32-ID-C of the Advanced Photon Source (APS) at Argonne National Laboratory. The voxel size for every dataset is 20 × 20 × 20 nm3. Specifically, (Ca,Cd)CO3 solid solution and (Ca,Cd,Zn)CO3 solid solution samples were scanned. \r\n\r\nThe samples were experimentally synthesized from aqueous solutions that were supersaturated with respect to all carbonate mineral endmembers: calcite, otavite, and smithsonite. The aqueous concentrations were chosen due to their environmental relevance. These results provide insights about trace element uptake in carbonate host minerals in contaminated environments. The voxel array for the selected (Ca,Cd)CO3 particle was 1024×1024×786. The voxel array for the selected (Ca,Cd,Zn)CO3 particle scanned at 8.000 keV was 2048×2048×1516 and when  scanned at 9.675 keV the voxel array was 1224×1224×1316. Additionally, we uploaded the voxel-registered data of the (Ca,Cd,Zn)CO3 particle, which is the end result of spatially registering the voxels in the scans at 8.000 keV and 9.675 keV . These two photon energies were chosen to maximize the X-ray attenuation contrast of Zn. This contrast was necessary for the quantitative analysis of (Ca,Cd,Zn)CO3.\r\n\r\nThis dataset also contains the elemental maps, which are quantitative maps of the chemical compositions of (Ca,Cd)CO3 and (Ca,Cd,Zn)CO3. The elemental maps were generated using LABQ3 (Yi et al., submitted) along a composition continuum, a method fundamentally different from conventional XCT analyses based on segmentation. Analyses revealed rich nano-scale compositional heterogeneity within individual particles. A mixture of calcium and cadmium carbonate revealed an overall composition of (Ca0.78,Cd0.22)CO3, with some voxels containing nearly pure CdCO3. The addition of zinc led to an overall composition of 33% Ca, 28% Cd, 39% Zn, with a nearly pure CaCO3 core and compositional zonation through the rim.",
    "DRP-157.json": "Imaging of imbibiiton process for a Bentheimer sandstone at different fractional flows at steady state",
    "DRP-45.json": "CT scans and processing of fractured welded tuff used for testing and demonstrating IPSF method for accurately measuring fracture position and aperture in heterogeneous natural materials (Ketcham et al., 2010).  Portions of output used for modeling flow in rough fractures (Cardenas et al., 2007, 2009).",
    "DRP-287.json": "Capillary rise experiments are conducted in homogeneous and vuggy porous media. The cores have been prepared using the method outlined in Khan et al. (2019).\r\n\r\nCapillary rise in vuggy and homogeneous porous media is conducted inside a micro-CT scanner (X-ray microtomograph Nikon XT-H 225 with 225 kV microfocus X-ray source with 3 µm focal spot size and an X-ray detector Varian Paxscan 1500 by 1900 pixels) at a resolution of ~25 microns. The scanner is located in Prof. Espinoza's laboratory at the University of Texas at Austin, Hildebrand Department of Petroleum and Geosystems Engineering.",
    "DRP-268.json": "In order to understand measurements from geophysical surveys, it is important to study rock samples in a laboratory setting. Digital rock physics (DRP) is a non invasive way estimate these same properties using numerical models. We have introduced a  workflow to estimate rock properties, and this repository accompanies a manuscript where we explain the method. Here, we include our CT scans of four Berea Sandstone plugs which are used in the manuscript by  Goldfarb, Ikeda, Ketcham, Prodanović Tisato (in prep).\r\n\r\nRecorded in the manuscript, we predict sample densities within 47 kg/cm3 of laboratory measurements, and porosities are estimated within 1.4 porosity percentage/units of the laboratory measurement.\r\n\r\nWe name our method \"Targeted\"\", or \"segmentation-less\". With it, we can quickly and accurately estimate rock properties. This includes  large samples, very small samples or oddly shaped samples, and rare samples. Processing samples with this technique is less arbitrary than \"segmentation\" (a common digital rock physics processing method), and is less cumbersome than some physical laboratory testing.\r\n\r\nDOI: 10.17612/9X96-AC88",
    "DRP-395.json": "This project contains micro-CT images of a super critical CO2-brine-glass system, at 41.7 C and 1180 psia.\r\nThe datasets include high exposure high quality (HQ) and low exposure low quality (LQ) scans of the two-phase saturated core. It also contains denoised versions of the LQ dataset, using:\r\n1- Traditional denoising filters: \r\nGaussian filter, Median filter, Non-local means (NLM) filter, Anisotropic diffusion (AD) filter, Bilateral filter, and Symmetric nearest neighbor (SNN) filter. \r\n2- Supervised deep learning denoising models: \r\nNoise-to-clean (N2C), Residual dense network (RDN), and Continuous conditional generative adversarial network (CCGAN)\r\n4- Unsupervised or reference-less deep learning denoising models (in cases where HQ datasets are not available as a reference):  \r\nNoise-to-void (N2V), and Noise-to-noise (N2N)\r\n5- Hybrid (or semi-supervised) deep learning denoising models that we propose, in cases where only limited HQ long exposure datasets are available (exploring the possibility of reducing scanning costs while preserving the accuracy of quantitative analyses):\r\nNoise-to-noise – 75% (N2N75), Noise-to-noise – 50% (N2N50), Noise-to-noise – 25% (N2N25)"
}